{"left": ["chair", "laptop"], "down": ["cup", "book"], "up": ["window", "building"], "right": ["potted plant"], "description": "A distant window and building silhouette the background. Nearby, a person is seated at a desk with a chair, laptop, and a cup and book on the surface. A potted plant sits to the right."}
{"left": ["tree", "frisbee"], "down": ["person", "backpack"], "up": ["kite"], "right": ["bench"], "description": "A kite dances in the sky above.  In the foreground, a person with a backpack walks along, while a frisbee is thrown near a tree to the left. A bench sits empty on the right."}
{"left": ["person", "backpack"], "down": ["frisbee", "sandwich"], "up": ["kite", "cloud"], "right": ["bench", "dog"], "description": "A kite dances in the wind above fluffy clouds in the distance.  A dog sits beside a bench in the right foreground, while a person with a backpack and someone enjoying a sandwich are closer to the viewer."}
{"left": ["skateboard", "frisbee"], "down": ["person", "backpack"], "up": ["kite", "trees"], "right": ["bench"], "description": "A kite dances in the wind against a backdrop of trees in the distance.  A person with a backpack walks towards the viewer, while a skateboard and frisbee are to the left. A bench sits to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["mountain", "airplane"], "right": ["bicycle", "parking meter"], "description": "In the distance, a mountain and airplane soar above. Directly in front, a person and car move steadily, while a bird perches on a nearby tree to the left, and a bicycle and parking meter sit to the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["building", "tree"], "right": ["traffic light", "parking meter"], "description": "In the distance, a building and tree stand tall, while directly in front, a car and bus are moving steadily. A person is visible to the left, and to the right, a traffic light and parking meter are situated at an intersection."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["airplane"], "right": ["traffic light"], "description": "In the distance, an airplane flies overhead. Directly in front, a car moves steadily, while a person holds an umbrella to the left, and a traffic light sits to the right."}
{"left": ["person", "bike rack"], "down": ["car", "pedestrian"], "up": ["train station", "bus"], "right": ["parking meter"], "description": "In the distance, a train station and bus can be seen. Directly in front, a car and pedestrian move steadily, while a person is locking their bike to a bike rack to the left, and a parking meter sits to the right."}
{"left": ["tree", "bench"], "down": ["dog", "person"], "up": ["house", "power line"], "right": ["car", "parking meter"], "description": "A house and power line are visible in the distance. In front, a person is walking with a dog, while a bench sits to the left and a car is parked near a parking meter on the right."}
{"left": ["person", "backpack"], "down": ["car", "bus"], "up": ["traffic light"], "right": ["bicycle", "handbag"], "description": "In the distance, a traffic light governs the intersection. Directly in front, a car and bus move steadily. A person with a backpack walks to the left, while a bicycle and a person with a handbag hurry to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "skyscraper"], "right": ["parking meter", "handbag"], "description": "In the distance, a traffic light and towering skyscraper are visible, while a car and bus move steadily in front. A person with an umbrella is walking down the sidewalk, and a parking meter stands to the right, near a handbag left behind."}
{"left": ["umbrella", "person"], "down": ["car", "bike"], "up": ["traffic light", "skyscraper"], "right": ["bench", "tree"], "description": "In the distance, a traffic light and tall skyscraper rise above the city. Directly in front, a car and bike move along the road, while a person holds an umbrella to the left, and a bench sits under a tree to the right."}
{"left": ["cat", "bird"], "down": ["person", "car", "bicycle"], "up": ["traffic light"], "right": ["bench"], "description": "In the distance, a traffic light hangs above the road. In front, a person walks, a car and bicycle move steadily, and a cat and bird perch nearby to the left, with a bench sitting to the right."}
{"left": ["person", "skateboard"], "down": ["car", "traffic light"], "up": ["parking meter", "tree"], "right": ["bicycle"], "description": "In the distance, a parking meter and tree are visible. Directly in front, a car passes by a traffic light, while a person is skateboarding to the left, and a bicycle is parked to the right."}
{"left": ["person", "bicycle"], "down": ["car", "bus"], "up": ["airplane", "cloud"], "right": ["traffic light", "tree"], "description": "In the distance, an airplane soars amidst the cloud formations. Directly in front, a car and bus move steadily, while a person and bicycle are visible to the left, and a traffic light stands next to a tree on the right."}
{"left": ["cat"], "down": ["person", "tree"], "up": ["church"], "right": ["dog"], "description": "In the distance, a church stands tall. Directly in front, a person walks under a tree, with a cat seen to the left and a dog strolling by to the right."}
{"left": ["person"], "down": ["car", "bike"], "up": ["airplane", "clouds"], "right": ["building"], "description": "An airplane flies far away, hidden behind clouds. Directly in front, a car and bike move steadily, while a person stands to the left, and a building stands tall to the right."}
{"left": ["person", "backpack"], "down": ["car", "traffic light"], "up": ["airplane"], "right": ["bus"], "description": "An airplane soars in the distance. In front, a car moves while a person with a backpack walks nearby, at the same time a traffic light stands near to them. A bus travels on the right side of the road."}
{"left": ["bird"], "down": ["person", "car"], "up": ["mountain"], "right": ["bicycle", "tree"], "description": "In the distance, a mountain stands tall. Directly in front, a person and car are clearly visible, with a bird to the left, a bicycle on the road, and a tree nearby to the right."}
{"left": ["bicycle", "person"], "down": ["car"], "up": ["hot air balloon"], "right": ["tree", "bench"], "description": "In the distance, a colorful hot air balloon floats above the landscape. Directly in front, a car speeds by, while a bicycle and person are visible to the left, and a tree towers over a bench to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "skyscraper"], "right": ["bike rack", "bike"], "description": "In the distance, a traffic light and skyscraper are visible. In front, a car and bus travel down the road, while a person holds an umbrella to the left, and a bike rack with a bike attached sits to the right."}
{"left": ["cat"], "down": ["dog", "person"], "up": ["parking meter", "fire hydrant"], "right": ["bench", "umbrella"], "description": "In the distance, a parking meter and fire hydrant mark the sidewalk. Directly in front, a person approaches with a dog by their side, while a cat sits to the left, and a person uses an umbrella to shield themselves from the rain beside a bench on the right."}
{"left": ["bird", "tree", "backpack"], "down": ["person", "car"], "up": ["church"], "right": ["bench", "vase"], "description": "In the distance, a church stands tall. Directly in front, a person walks along the path beside a car, with a bird perched in a nearby tree to the left, and a bench accompanied by a vase sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "building"], "right": ["bench"], "description": "On the horizon, a traffic light and building stand out. Directly in front, a car and bus are visible, while a person holding an umbrella walks to the left, and a bench sits to the right."}
{"left": ["person", "bike rack"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["traffic light", "bus"], "description": "In the distance, an airplane flies above, near a cloud. A car drives directly in front, while to the left, a person is standing next to a bike rack, and a traffic light and bus are visible to the right."}
{"left": ["person", "frisbee"], "down": ["dog", "skateboarder"], "up": ["tree", "giraffe"], "right": ["bench", "umbrella"], "description": "In the distance, a tree stands tall and a giraffe roams with it. Directly in front, a dog and skateboarder are visible, while a person throws a frisbee to the left, and a bench sits to the right under a person holding an umbrella."}
{"left": ["cat", "dog"], "down": ["person", "umbrella"], "up": ["building", "skyscraper"], "right": ["tree", "bench"], "description": "In the distance, a building and skyscraper rise high. Directly in front, a person holds an umbrella, while a cat and dog are visible to the left, and a tree and bench sit to the right."}
{"left": ["person", "skateboard"], "down": ["car", "traffic light"], "up": ["building", "cell phone"], "right": ["bike rack", "bicycle"], "description": "A tall building looms in the distance, with a person's hand holding a cell phone near the top. Directly in front, a car waits at the traffic light, while a person on a skateboard glides to the left, and a bicycle leans against a bike rack on the right."}
{"left": ["person", "bike rack"], "down": ["car", "parking meter"], "up": ["traffic light"], "right": ["bus", "bike"], "description": "In the distance, a traffic light hangs. In front, a car beside a parking meter, with a person and bike rack to the left, and a bus with a bike on the right proceeds down the road."}
{"left": ["person"], "down": ["car", "traffic light"], "up": ["airplane", "cloud"], "right": ["bicycle"], "description": "In the distance, an airplane flies above clouds. Directly in front, a traffic light stands steady, as a car slows down, and a person walks to the left, with a bicycle passing by to the right."}
{"left": ["person", "car"], "down": ["traffic light", "bus"], "up": ["airplane", "airplane"], "right": ["pedestrian", "motorcycle"], "description": "In the distance, two airplanes are flying high. Directly in front, a bus stops at a traffic light, while a person and car are visible to the left, and a pedestrian walks beside a motorcycle on the right."}
{"left": ["tree", "person"], "down": ["car", "dog"], "up": ["house", "giraffe"], "right": ["parking meter", "bus"], "description": "In the distance, a house and a giraffe appear in a residential area. Directly in front, a car moves steadily, while a person walks beside a dog, with a tree to the left, a parking meter adjacent to a bus on the right."}
{"left": ["bird", "tree (assuming tree is a potted plant in this context)"], "down": ["person", "car"], "up": ["airplane"], "right": ["house"], "description": "An airplane floats in the sky above. In front, a person and car are visible, with a bird perched to the left, and a house stands to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane"], "right": ["umbrella"], "description": "An airplane flies in the distance. A person walks with a bicycle near a car in front, while an umbrella sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "parking meter"], "up": ["building"], "right": ["bench"], "description": "In the distance, a tall building appears. Directly in front, a car is parked next to a parking meter, with a person and umbrella to the left, and a bench sits to the right."}
{"left": ["bench"], "down": ["person", "car"], "up": ["airplane", "tree"], "right": ["bicycle"], "description": "In the distance, an airplane flies through the sky with a tree nearby. Directly in front, a person stands near a car, while a bicycle sits to the right and a bench is visible to the left."}
{"left": ["bird"], "down": ["person", "car"], "up": ["traffic light", "stop sign"], "right": ["bicycle", "bus"], "description": "A traffic light and stop sign appear in the distance. Directly in front, a person and car are clearly visible, with a bird flying overhead to the left and a bicycle alongside a bus on the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["bench"], "right": ["bus", "parking meter"], "description": "A bench sits in the distance. Directly in front, a person and car are visible, while a bird perches to the left beneath a tree and a bus stops near a parking meter on the right."}
{"left": ["bird", "tree"], "down": ["person", "bicycle"], "up": ["skyscraper"], "right": ["parking meter", "car"], "description": "A skyscraper stands far away. In front, a person on a bicycle glides smoothly, with a bird flying overhead to the left, while a parking meter and car sit to the right."}
{"left": ["bird", "tree"], "down": ["person", "car", "dog"], "up": ["mountain", "building"], "right": ["bench", "parking meter"], "description": "In the distance, a mountain and building stand tall. Directly in front, a person and car move steadily, while a bird is visible to the left and a dog by their side. A bench and parking meter occupy the right side of the scene, with a distant mountain range in the background."}
{"left": ["tree", "person"], "down": ["car", "pedestrian"], "up": ["building", "airplane"], "right": ["parking meter", "bus"], "description": "A building and airplane can be seen in the distance. Directly in front, a car drives by with a pedestrian walking. To the left, a tree stands and a person occasionally stops, while a bus passes by a parking meter to the right."}
{"left": ["person"], "down": ["car", "stop sign", "parking meter"], "up": ["traffic light", "bus"], "right": ["bicycle"], "description": "In the distance, a traffic light and bus are visible. Directly in front, a car stops beside a stop sign and parking meter, while a person is walking to the left, and a bicycle passes on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["traffic light", "building"], "right": ["bus", "parking meter"], "description": "In the distance, a traffic light and building appear along the road. Directly in front, a car and bicycle are visible, while a person holds an umbrella to the left, and a bus and parking meter sit to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["skyscraper", "airplane"], "right": ["bus", "tree"], "description": "In the distant sky, a skyscraper and airplane are visible. Directly in front, a car and bicycle move steadily, while a person shields themselves with an umbrella to the left, and a bus drives past a tree on the right."}
{"left": ["person", "umbrella"], "down": ["car", "traffic light"], "up": ["airplane", "airport building"], "right": ["parking meter", "bicycle"], "description": "In the distance, an airplane and airport building stand out, while a person holding an umbrella walks on the left side. Directly in front, a car and traffic light are visible, with a parking meter and bicycle to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["airplane", "cloud"], "right": ["bench"], "description": "An airplane flies high in the distant sky, with clouds drifting nearby. Directly in front, a person and car move along the road, while a bird is spotted to the left, and a bench sits beneath a tree to the right."}
{"left": ["person", "skateboard"], "down": ["car", "pedestrian"], "up": ["traffic light", "parking meter"], "right": ["bicycle", "umbrella"], "description": "In the distance, a traffic light and parking meter line the road. Directly in front, a car and person are preparing to cross, while a skateboarder glides by to the left and a bicycle and umbrella sit to the right, indicating a rainy day."}
{"left": ["bird", "tree"], "down": ["person", "skateboard"], "up": ["mountain", "hiking trail"], "right": ["bicycle", "parking meter"], "description": "In the distance, a mountain and a hiking trail unfold, inviting exploration. Directly in front, a person skillfully rides a skateboard, while a bird perches nearby, and to the left, a tree stands tall. A bicycle sits parked beside a meter to the right."}
{"left": ["cat", "tree"], "down": ["person", "dog", "bench"], "up": ["house", "bird"], "right": ["car", "parking meter"], "description": "In the distance, a house and bird perched on a tree branch are seen. Directly in front, a person sits on a bench with their dog, while a car and parking meter sit to the right."}
{"left": ["person", "backpack", "bike helmet"], "down": ["car", "traffic light"], "up": ["mountain", "ski resort"], "right": ["skis", "snowboard"], "description": "In the distance, a mountain and ski resort are visible. Directly in front, a car stops at a traffic light, while a person with a backpack and bike helmet is preparing to hit the slopes to the left, and skis and a snowboard wait to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light", "skyscraper"], "right": ["bench"], "description": "A skyscraper and traffic light appear in the distance. Directly in front, a car and bicycle travel down the road, while a person with an umbrella stands to the left, and a bench sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "tree"], "up": ["airplane", "cloud"], "right": ["bench", "potted plant"], "description": "An airplane soars in the sky, with a cloud nearby. In front, a car is parked under a tree, while a person holds an umbrella to the left, and a bench sits beside a potted plant to the right."}
{"left": ["bird", "tree", "parking meter"], "down": ["person", "bicycle"], "up": ["telegraph pole", "building"], "right": ["bus"], "description": "In the distance, a telegraph pole and building stand out. Directly in front, a person and bicycle are visible, with a bird and parking meter nearby. A bus drives by on the right."}
{"left": ["person", "umbrella"], "down": ["car", "motorcycle"], "up": ["traffic light"], "right": ["bench", "potted plant"], "description": "In the distance, a traffic light guides the flow of traffic. Directly in front, a car and motorcycle speed by, while a person holds an umbrella to the left, and a bench and potted plant sit to the right on the sidewalk."}
{"left": ["person", "umbrella"], "down": ["car", "pedestrian"], "up": ["traffic light", "skyscraper"], "right": ["bike rack", "parking meter"], "description": "In the distance, a traffic light and tall skyscraper appear along the road. Directly in front, a car and pedestrian move steadily, while a person and umbrella are visible to the left, and a bike rack and parking meter sit to the right."}
{"left": ["person", "umbrella"], "down": ["car", "traffic light"], "up": ["airplane"], "right": ["bus"], "description": "In the distance, an airplane flies above. Directly in front, a car and traffic light are visible, with a person holding an umbrella to the left, and a bus moves steadily to the right."}
{"left": ["cat", "backpack"], "down": ["dog", "chair"], "up": ["bench"], "right": ["person", "skateboard"], "description": "In the distance, a bench can be seen. Directly in front, a dog is sitting on a chair, while a cat and backpack appear to the left, and a person is skating with a skateboard to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light"], "right": ["bench"], "description": "In the distance, a traffic light is visible. In front, a car and bus move steadily, with a person holding an umbrella and sitting next to a bench on the right, and the person's companion walking beside them on the left."}
{"left": ["person", "dog"], "down": ["car", "bicycle"], "up": ["fire hydrant", "house"], "right": ["parking meter", "tree"], "description": "In the distance, a fire hydrant and a house appear along the road. Directly in front, a car and bicycle move steadily, while a person and dog are visible to the left, and a parking meter sits beside a tree to the right."}
{"left": ["person", "umbrella"], "down": ["car", "traffic light"], "up": ["skyscraper", "airplane"], "right": ["bike rack", "bike"], "description": "In the distance, a skyscraper and airplane soar. In front, a car and traffic light stand out, with a person holding an umbrella to the left, and a bike rack and bike on the right."}
{"left": ["person", "potted plant"], "down": ["car", "traffic light"], "up": ["building", "car"], "right": ["bike rack", "bicycle"], "description": "In the distance, a building and a car are seen on the road. Directly in front, a car and traffic light are visible, while a person and potted plant are to the left, and a bicycle is parked in a bike rack on the right."}
{"left": ["tree", "potted plant"], "down": ["person", "dog"], "up": ["church steeple"], "right": ["bench", "skateboard"], "description": "In the distance, a church steeple rises above the neighborhood. In front, a person and dog walk down the sidewalk, with a tree and potted plant near the path, and a bench sits next to a skateboard on the right."}
{"left": ["person"], "down": ["car", "umbrella"], "up": ["skyscraper"], "right": ["bicycle"], "description": "In the distance, a skyscraper dominates the skyline. Directly in front, a car slowly moves with a person holding an umbrella, while a bicycle is visible to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane"], "right": ["traffic light"], "description": "In the distance, an airplane soars above. Directly in front, a car moves steadily, while a person and bicycle are visible to the left and a traffic light to the right."}
{"left": ["bird", "tree"], "down": ["dog", "person"], "up": ["house"], "right": ["car", "parking meter"], "description": "A house stands in the distance. Directly in front, a person and dog are walking, while a bird perches in a tree to the left, and a car is parked beside a parking meter on the right."}
{"left": ["bird", "cat"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bicycle"], "description": "A traffic light appears in the distance. Directly in front, a person and car move, while a bird and cat sit on a nearby tree to the left, and a bicycle rides by on the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["plane"], "right": ["bench", "potted plant"], "description": "A plane flies high in the distance. In front, a person stands next to a car, with a bird perched nearby, while a bench sits under a potted plant to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light stands tall. Directly in front, a car and bus are moving steadily, while a person steps under an umbrella to the left, and a bicycle rides by on the right."}
{"left": ["person"], "down": ["car", "bicycle"], "up": ["fire hydrant"], "right": ["bus"], "description": "In the distance, a fire hydrant stands on the sidewalk. Directly in front, a car and bicycle are parked, with a person nearby, and a bus passes by to the right."}
{"left": ["giraffe", "potted plant"], "down": ["person", "frisbee"], "up": ["skyscraper", "helicopter"], "right": ["parking meter", "umbrella"], "description": "In the distance, a skyscraper and helicopter appear in the urban sky. Directly in front, a person relaxes and plays with a frisbee, while a giraffe and potted plant stand to the left, and a parking meter and person with an umbrella to the right."}
{"left": ["person"], "down": ["car", "bike"], "up": ["building", "tree"], "right": ["parking meter"], "description": "A building and tree stand in the distance. In front, a car and bicycle move steadily, while a person is visible to the left, and a parking meter sits to the right, near a parked bike."}
{"left": ["bird"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light stands tall. Directly in front, a person walks towards the road, while a car approaches, and a bird can be seen flying overhead to the left, with a bicycle parked nearby on the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bench", "bus"], "description": "In the distance, a traffic light stands tall. In front, a person and car are clearly visible, with a bird flying overhead, while a bench sits beside a bus on the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane"], "right": ["bicycle", "parking meter"], "description": "In the distance, an airplane descends towards the runway. Directly in front, a car and bus move steadily, while a person walks to the left, and a bicycle and parking meter sit to the right."}
{"left": ["cat", "tree"], "down": ["person", "dog", "bench"], "up": ["house"], "right": ["squirrel", "bike rack"], "description": "In the distance, a house stands tall. Directly in front, a person sits on a bench with their dog by their side, while a cat roams to the left, and a bike rack with a squirrel nearby sits to the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["hot air balloon"], "right": ["bicycle", "bus"], "description": "In the distance, a hot air balloon floats above the landscape. Directly in front, a person and car move along the road, while a bird is perched to the left, and a bicycle and bus drive by on the right."}
{"left": ["umbrella", "person"], "down": ["car", "handbag"], "up": ["traffic light", "building"], "right": ["bus"], "description": "A traffic light and building appear in the distance. Directly in front, a car moves steadily, while a person holds an umbrella, and a handbag is visible to the left, with a bus passing by on the right."}
{"left": ["person"], "down": ["car"], "up": ["airplane", "giraffe"], "right": ["bicycle"], "description": "In the distance, an airplane flies high above, accompanied by a giraffe on a farm. A person walks along the road to the left, while a bicycle sits idle to the right. Directly in front, a car drives steadily through the landscape."}
{"left": ["bird"], "down": ["person", "car"], "up": ["stop sign", "traffic light"], "right": ["bicycle"], "description": "A stop sign and traffic light rise above the horizon. Directly in front, a person walks near a car, while a bird flies to the left, and a bicycle rides by on the right."}
{"left": ["bird", "tree"], "down": ["person", "car", "bike"], "up": ["mountain", "bridge"], "right": ["bus", "parking meter"], "description": "A mountain and bridge are visible in the distance. In front, a person stands, with a car and bike parked nearby. A bird perches on a nearby tree to the left, and a bus passes a parking meter to the right."}
{"left": ["person", "car"], "down": ["bicycle"], "up": ["airplane"], "right": ["bench"], "description": "In the distance, an airplane soars above. Directly in front, a bicycle is stationary, while a person and car are visible to the left, and a bench sits to the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["skyscraper"], "right": ["bicycle", "parking meter"], "description": "In the distance, a skyscraper dominates the view. In front, a person and car are clearly visible, with a bird to the left and a bicycle and parking meter on the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["church"], "right": ["parking meter"], "description": "In the distance, a church dominates the landscape. In front, a car sits stationary, while a person heads towards it on the left, and a bicycle is parked nearby, with a parking meter visible to the right."}
{"left": ["person"], "down": ["car"], "up": ["airplane", "clouds"], "right": ["tree"], "description": "High in the sky, an airplane flies by, surrounded by white clouds. Directly in front, a car moves steadily down the street, while a person walks to the left, and a tree stands tall to the right."}
{"left": ["dog", "tree"], "down": ["person", "parking meter"], "up": ["bird", "house"], "right": ["car", "bench"], "description": "In the distance, a bird perches on a house, while a tree stands beside a dog. Directly in front, a person is standing near a parking meter, with a car parked to the right and a bench beside it."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["airplane", "bird"], "right": ["traffic light"], "description": "In the distance, an airplane and a bird soar overhead. Directly in front, a car and bus move steadily, while a person with an umbrella stands to the left, and a traffic light sits to the right."}
{"left": ["person", "backpack"], "down": ["car", "bicycle"], "up": ["traffic light", "stop sign"], "right": ["bench", "umbrella"], "description": "In the distance, a traffic light and stop sign stand on the road. Directly in front, a car and bicycle move steadily, while a person with a backpack walks beside them, and a bench and umbrella sit to the right."}
{"left": ["frisbee", "person"], "down": ["bench", "tree", "dog"], "up": ["house", "bird"], "right": ["parking meter", "umbrella"], "description": "In the distance, a house and bird are seen. Directly in front, a bench sits near a tree, with a dog nearby, while a person tosses a frisbee to the left, and a parking meter and umbrella are visible to the right."}
{"left": ["person", "cat", "skateboard"], "down": ["car", "bike"], "up": ["church", "tree"], "right": ["bench", "fire hydrant"], "description": "A church and tree stand in the distance. In front, a car and bike move steadily, while a person and cat are visible to the left, and a bench beside a fire hydrant sit to the right."}
{"left": ["tree", "backpack"], "down": ["person", "dog"], "up": ["skyscraper", "airplane"], "right": ["parking meter", "bike rack"], "description": "In the distance, a skyscraper and airplane are visible. Directly in front, a person walks with a dog, while a tree and backpack are seen to the left, and a parking meter and bike rack sit to the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["church"], "right": ["bench"], "description": "In the distance, a church stands tall. In front, a car drives by, with a person holding an umbrella walking to the left, and a bench sits to the right."}
{"left": ["person"], "down": ["car", "potted plant"], "up": ["tree"], "right": ["bench"], "description": "High up in the trees, a single branch is visible. Directly in front, a car moves along the road, near a potted plant, while a person is walking to the left, and a bench sits to the right, perhaps a resting point for the pedestrian."}
{"left": ["person", "umbrella"], "down": ["car", "motorcycle"], "up": ["building", "bird"], "right": ["bicycle"], "description": "A building stands tall in the distance, accompanied by a bird perched on its edge. On the road, a car and motorcycle speed by, with a person walking to the left under an umbrella and a bicycle to the right."}
{"left": ["person"], "down": ["car", "bicycle"], "up": ["school building"], "right": ["parking meter"], "description": "In the distance, a school building stands tall. Directly in front, a car and bicycle approach the road, with a person walking to the left and a parking meter to the right."}
{"left": ["person", "tree"], "down": ["car", "pedestrian crossing"], "up": ["bench", "church spire"], "right": ["bus"], "description": "In the distance, a church spire and bench are visible, with a bus traveling down the road. Directly in front, a car approaches a pedestrian crossing, where a person is waiting, while trees sit to the left."}
{"left": ["person", "backpack"], "down": ["car"], "up": ["airplane"], "right": ["motorcycle"], "description": "An airplane flies far away. In front, a car moves steadily. To the left, a person is walking with their backpack, while a motorcycle sits to the right."}
{"left": ["tree", "bench"], "down": ["person", "car"], "up": ["house", "power line"], "right": ["parking meter", "umbrella"], "description": "In the distance, a house and power line are visible. Directly in front, a person walks along the sidewalk, while a car passes by, with a tree and bench to the left, and a parking meter and umbrella sit to the right under the shelter."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "skyscraper"], "right": ["bench", "tree"], "description": "In the distance, a traffic light and a tall skyscraper rise up. Directly in front, a car and bus move steadily along the road, while a person with an umbrella stands to the left, and a bench sits beside a tree on the right."}
{"left": ["tree", "bird"], "down": ["person", "car"], "up": ["mountain", "airplane"], "right": ["bike", "parking meter"], "description": "In the distance, a mountain and airplane appear on the horizon. Directly in front, a person and car move steadily, while a bird is visible to the left near a tree, and a bike sits beside a parking meter to the right."}
{"left": ["person", "tree", "bench"], "down": ["car", "bus", "parking meter"], "up": ["airplane", "cloud"], "right": ["bike rack", "bicycle"], "description": "In the distance, an airplane flies above the clouds. In front, a car and bus move along the road, where a person sits beside a bench. A parking meter stands nearby, and a bicycle is locked to a bike rack to the right."}
{"left": ["person", "backpack"], "down": ["bicycle", "potted plant"], "up": ["traffic light", "bus"], "right": ["parking meter", "handbag"], "description": "A traffic light and bus are seen in the distance. In front, a bicycle and potted plant sit near a person, while a parking meter and handbag are visible to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["traffic light", "parking meter"], "right": ["bench"], "description": "In the distance, a traffic light and parking meter are visible, and a person walks under an umbrella. Directly in front, a car and bike move steadily, with a bench to the right."}
{"left": ["bicycle"], "down": ["person", "car"], "up": ["airplane", "mountain"], "right": ["tree"], "description": "Far in the distance, an airplane soars above a mountain range. Directly in front, a car moves along the road with a person walking beside it, while a bicycle is parked to the left, and a lone tree stands to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["airplane", "bird"], "right": ["traffic light", "bench"], "description": "An airplane flies high in the distance, accompanied by a bird. In front, a car and bicycle move swiftly, while a person holds an umbrella on the left and a traffic light stands near a bench on the right."}
{"left": ["person", "backpack"], "down": ["car", "motorcycle"], "up": ["traffic light"], "right": ["bench", "potted plant"], "description": "A traffic light stands in the distance. Directly in front, a car and motorcycle are moving, with a person carrying a backpack to the left and a bench and potted plant to the right."}
{"left": ["person", "bike rack"], "down": ["car", "bus"], "up": ["traffic light", "high-rise building"], "right": ["bench", "umbrella"], "description": "In the distance, a traffic light and high-rise building stand tall. Directly in front, a car and bus move steadily, while a person and bike rack are visible to the left, and a bench sits under an umbrella to the right."}
{"left": ["person"], "down": ["car", "parking meter", "umbrella"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light appears on the street. Directly in front, a car and a person with an open umbrella are near a parking meter, while a bicycle is parked to the right."}
{"left": ["bird", "bench"], "down": ["car", "person"], "up": ["airplane", "building"], "right": ["tree", "parking meter"], "description": "In the distance, an airplane soars above a building. A car and person are directly in front, while a bird sits on a bench to the left, and a tree and parking meter sit to the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["airplane", "cloud"], "right": ["bus"], "description": "In the distance, an airplane flies high above, near a cloud. Directly in front, a person and car move steadily, while a bird is visible to the left, and a bus travels on the right."}
{"left": ["cat", "tree"], "down": ["person", "bench"], "up": ["house"], "right": ["dog", "parking meter"], "description": "In the distance, a house stands tall. Directly in front, a person sits on a bench, while a cat is visible to the left, and a dog and parking meter sit to the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["church"], "right": ["bus", "traffic light"], "description": "A church rises in the distance. In front, a car drives steadily, while a person walks to the left under an umbrella, and a bus passes by a traffic light to the right."}
{"left": ["bird", "tree"], "down": ["person", "skateboard"], "up": ["mountain"], "right": ["house", "car"], "description": "A mountain stands in the distance, with a bird perched nearby. In front, a person rides a skateboard, while a house and car sit to the right, and trees surround the area."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["mountain", "airplane"], "right": ["bench", "bus"], "description": "In the distance, a mountain and airplane soar above, while directly in front, a person and car move by a bench on the right, and a bird flies overhead."}
{"left": ["person", "handbag"], "down": ["car", "potted plant"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light signals the intersection. Directly in front, a car drives by and a potted plant sits on the sidewalk, while a person walks to the left, accompanied by a handbag, and a bicycle is parked on the right."}
{"left": ["cat", "bird"], "down": ["person", "car"], "up": ["airplane", "traffic light"], "right": ["bench", "tree"], "description": "In the distance, an airplane flies overhead, with a traffic light beside it. A person and car are directly in front, while a cat and bird perch near each other to the left, and a bench sits beneath a tree on the right."}
{"left": ["bird"], "down": ["person", "chair", "table"], "up": ["tree", "bench"], "right": ["book", "cup"], "description": "In the distance, a tree and bench are situated in a park. Directly in front, a person sits at a table, with a bird nearby to the left, and a book and cup on a nearby surface to the right."}
{"left": ["person", "dog"], "down": ["car", "pedestrian"], "up": ["skyscraper", "airplane"], "right": ["bus"], "description": "In the distance, a skyscraper and airplane tower above. Directly in front, a car and pedestrian move steadily, while a person walks with a dog to the left, and a bus heads down the road to the right."}
{"left": ["cat", "tree"], "down": ["person", "bench", "dog"], "up": ["skyscraper"], "right": ["potted plant", "umbrella"], "description": "In the distance, a skyscraper towers above. Directly in front, a person sits on a bench with a dog by their side, while a cat is perched in a nearby tree to the left, and a potted plant and umbrella sit to the right."}
{"left": ["person"], "down": ["car", "traffic light"], "up": ["airplane", "mountain"], "right": ["bicycle"], "description": "In the distance, an airplane soars above mountains. Directly in front, a car and traffic light are visible near a person to the left and a bicycle on the right."}
{"left": ["person", "cat"], "down": ["car"], "up": ["traffic light"], "right": ["bench", "umbrella"], "description": "A traffic light appears in the distance. Directly in front, a car is visible, with a person walking nearby and a cat strolling behind them. A bench sits to the right, and an umbrella is propped against it."}
{"left": ["person"], "down": ["car", "fire hydrant", "traffic light"], "up": ["bus"], "right": ["bench"], "description": "In the distance, a bus appears on the road. Directly in front, a car stops beside a fire hydrant and traffic light, while a person walks to the left, and a bench sits nearby to the right."}
{"left": ["person", "umbrella"], "down": ["car", "motorcycle"], "up": ["traffic light", "skyscraper"], "right": ["bike rack", "bus stop"], "description": "In the distance, a traffic light and skyscraper are visible. A car and motorcycle are directly in front, while a person with an umbrella stands to the left and a bike rack and bus stop sit on the right side of the road."}
{"left": ["person", "bench"], "down": ["car"], "up": ["traffic light", "airplane"], "right": ["bus"], "description": "In the distance, a traffic light and an airplane are visible in the sky. Directly in front, a car speeds by, while a person and a bench sit to the left, and a bus waits patiently on the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["tree", "bird"], "right": ["parking meter"], "description": "A tree and bird are seen in the distance. In front, a car moves through the scene, while a person walks to the left under an umbrella, and a parking meter sits to the right."}
{"left": ["cat", "bird"], "down": ["person", "car"], "up": ["tree", "church"], "right": ["bench", "potted plant"], "description": "In the distance, a tree and church stand tall. In front, a person and car move steadily, while a cat and bird perch to the left, and a bench alongside a potted plant sit to the right."}
{"left": ["person", "dog"], "down": ["car", "bicycle"], "up": ["traffic light", "bus"], "right": ["bench"], "description": "In the distance, a traffic light and bus appear along the road. Directly in front, a car moves steadily, while a bicycle is parked nearby, a person walking their dog to the left, and a bench sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light"], "right": ["bench", "tree"], "description": "In the distance, a traffic light appears along the road. Directly in front, a car and bus move steadily, while a person walks to the left, holding an umbrella, and a bench sits next to a tree on the right."}
{"left": ["cat", "dog"], "down": ["person", "car", "tree"], "up": ["bus"], "right": ["bench"], "description": "In the distance, a bus travels along the road. Directly in front, a person stands beside a car, with a tree nearby, while a cat and dog are visible to the left, and a bench sits to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["mountain"], "right": ["bench", "potted plant"], "description": "In the distance, a mountain range appears on the horizon. In front, a person and car move down the road, while a bird perches on a nearby tree to the left, and a bench sits beside a potted plant on the right."}
{"left": ["person", "bike"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["potted plant"], "description": "In the distance, an airplane flies above the clouds. Directly in front, a car moves steadily, while a person and bicycle ride past to the left, and a potted plant sits on the sidewalk to the right."}
{"left": ["person", "bike"], "down": ["car", "traffic light"], "up": ["airplane"], "right": ["bench"], "description": "An airplane flies in the distance. A car and traffic light are directly in front, with a person and bike to the left, and a bench sits to the right."}
{"left": ["bird", "person"], "down": ["car", "parking meter"], "up": ["stop sign", "traffic light"], "right": ["bicycle"], "description": "A stop sign and traffic light are visible in the distance. In front, a car and parking meter are seen, with a person walking nearby and a bicycle on the right."}
{"left": ["cat", "person"], "down": ["car", "dog"], "up": ["traffic light", "building"], "right": ["bike rack", "fire hydrant"], "description": "In the distance, a traffic light and building appear along the road. Directly in front, a car and dog move together, while a cat walks with a person to the left, and a bike rack and fire hydrant sit to the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane"], "right": ["traffic light"], "description": "In the distance, an airplane appears above the horizon. A car and bus move steadily in front, with a person walking to the left and a traffic light standing to the right."}
{"left": ["person", "skateboard"], "down": ["car", "bike rack"], "up": ["building", "parking meter"], "right": ["traffic light"], "description": "A building and parking meter are visible in the distance. Directly in front, a car is parked with a bike rack attached, while a person is skateboarding to the left and a traffic light guides the way to the right."}
{"left": ["person"], "down": ["car"], "up": ["traffic light", "train"], "right": ["bench"], "description": "In the distance, a traffic light and train appear along the road. Directly in front, a car moves steadily. A person is walking to the left, and a bench sits to the right."}
{"left": ["person"], "down": ["car", "parking meter"], "up": ["traffic light"], "right": ["bike rack", "bicycle"], "description": "A traffic light is visible in the distance. In front, a car is parked near a parking meter, while a person stands to the left and two bicycles are secured to a bike rack on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["parking meter", "fire hydrant"], "right": ["tree", "sign"], "description": "In the distance, a parking meter and fire hydrant are lined up along the sidewalk. Directly in front, a car moves forward and a bike is parked nearby, while a person under an umbrella walks to the left, and a tree and sign stand to the right."}
{"left": ["person", "dog"], "down": ["car", "bus"], "up": ["building", "tree"], "right": ["pedestrian", "cycle rack"], "description": "In the distance, a building and tree stand near the road. Directly in front, a car and bus move steadily, while a person and dog are visible to the left, and a pedestrian walks alongside a cycle rack on the right."}
{"left": ["person"], "down": ["car", "bicycle"], "up": ["airplane", "traffic light"], "right": ["bus"], "description": "An airplane and traffic light appear in the distance. In front, a car and bicycle move down the road, with a person walking beside them, while a bus travels by on the right."}
{"left": ["bird", "tree"], "down": ["person", "car", "bus"], "up": ["skyscraper", "airplane"], "right": ["bench", "potted plant"], "description": "In the distance, a skyscraper and airplane soar above the city. Directly in front, a person and car are parked beside a bus, while a bird perches on a tree to the left and a bench sits beside a potted plant to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["tree", "house"], "description": "In the distance, an airplane flies through the sky above fluffy white clouds. Directly in front, a car travels steadily, while a person and bicycle are visible to the left, and a tree and house sit to the right."}
{"left": ["person", "sports ball"], "down": ["dog", "bench"], "up": ["tree", "bird"], "right": ["skateboard", "potted plant"], "description": "High above, a tree stands tall, alongside a bird in flight. Directly in front, a dog and a person on a bench are engaged in a friendly interaction, while a skateboard leans against a potted plant to the right, and a sports ball rests nearby."}
{"left": ["person", "dog"], "down": ["car", "parking meter"], "up": ["traffic light", "skyscraper"], "right": ["bench", "tree"], "description": "In the distance, a traffic light and skyscraper are visible. Directly in front, a car is parked beside a parking meter, while a person and a dog walk by to the left, and a bench sits under a tree to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light hangs over the road. A person holding an umbrella stands near the car, while a bus moves steadily by, and a bicycle passes on the right."}
{"left": ["car", "person"], "down": ["bus", "stop sign"], "up": ["highway", "airplane", "cloud"], "right": ["tree", "bench"], "description": "In the distance, a highway, airplane, and cloud can be seen. Directly in front, a bus and stop sign are visible, with a car and person to the left, and a tree and bench on the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane"], "right": ["parking meter"], "description": "An airplane soars in the sky. Directly in front, a car and bus travel down the road, with a person walking to the left and a parking meter to the right."}
{"left": ["person", "bike rack"], "down": ["car", "pedestrian crossing"], "up": ["highway sign", "airplane"], "right": ["bus stop"], "description": "In the distance, a highway sign and airplane appear in the sky. Directly in front, a car stops at a pedestrian crossing, while a person walks nearby, and a bike rack sits to the left, with a bus stop on the right."}
{"left": ["person", "dog"], "down": ["car", "bike"], "up": ["house", "tree"], "right": ["bench", "potted plant"], "description": "In the distance, a house and tree line the road. Directly in front, a car and bike ride along the sidewalk, while a person and dog walk together to the left, and a bench sits beside a potted plant on the right."}
{"left": ["person", "skateboard"], "down": ["car", "tree"], "up": ["mountain", "ski lift"], "right": ["bench"], "description": "In the distance, a mountain and ski lift are visible. In front, a car moves steadily beside a tree, while a person on a skateboard are visible to the left, and a bench sits to the right."}
{"left": ["cat", "potted plant"], "down": ["person", "dog"], "up": ["fire hydrant"], "right": ["bench", "cup"], "description": "A fire hydrant stands in the distance. Directly in front, a person and dog are walking together, while a cat and potted plant sit to the left, and a person rests on a bench beside a cup on the right."}
{"left": ["bird", "tree"], "down": ["person", "dog", "bench"], "up": ["church"], "right": ["laptop", "book"], "description": "In the distance, a church towers above the landscape. A person sits on a bench, accompanied by a dog, directly in front. A bird flutters nearby to the left, while a laptop and book sit open to the right."}
{"left": ["tree", "person"], "down": ["car", "pedestrian"], "up": ["airplane", "cloud"], "right": ["house", "parking meter"], "description": "In the distance, an airplane flies overhead amidst a cloud. Directly in front, a car moves steadily, and a pedestrian walks beside it on the left, near a tree. To the right, a house stands with a parking meter in front."}
{"left": ["tree", "bird"], "down": ["car", "person"], "up": ["airplane"], "right": ["parking meter", "bike rack"], "description": "In the distance, an airplane glides through the sky. In front, a car and person move along the road, with a tree and bird seen to the left and a parking meter and bike rack nearby on the right."}
{"left": ["bird", "bicycle"], "down": ["car", "person"], "up": ["airplane", "cloud"], "right": ["tree", "bench"], "description": "In the distance, an airplane flies across the sky, accompanied by a cloud. Directly in front, a car and person move steadily, with a bird perched on a bicycle to the left, and a tree and bench sitting to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "traffic light"], "right": ["bicycle", "backpack"], "description": "In the distance, two traffic lights stand tall. Directly in front, a car and bus drive down the road, while a person walks to the left under an umbrella, and a bicycle sits with a backpack near the curb on the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["airplane", "cloud"], "right": ["bench"], "description": "In the distance, an airplane flies among the clouds. Directly in front, a person and car move along the sidewalk, with a bird perched nearby, and a bench sits to the right."}
{"left": ["bicycle", "person"], "down": ["car", "dog"], "up": ["traffic light", "tree"], "right": ["bench", "potted plant"], "description": "In the distance, a traffic light and a tree appear along the road. Directly in front, a car moves steadily, while a bicycle and person are visible to the left, and a dog is standing near the car, with a bench and a potted plant to the right."}
{"left": ["bird", "umbrella"], "down": ["person", "car"], "up": ["traffic light", "building"], "right": ["bench", "tree"], "description": "In the distance, a traffic light and a tall building appear, with birds flying overhead. Directly in front, a person and car move steadily, while a bird and an umbrella sit to the left, and a bench and a tree sit to the right."}
{"left": ["cat", "potted plant"], "down": ["person", "dog"], "up": ["church"], "right": ["tree", "bike"], "description": "A church stands in the distance. In front, a person and dog are walking, with a cat and potted plant near by, and a bike parked under a tree on the right."}
{"left": ["person"], "down": ["car", "parking meter"], "up": ["traffic light", "building"], "right": ["bench"], "description": "In the distance, a traffic light and building stand tall. Directly in front, a person walks towards a parked car, with a parking meter nearby to the left, and a bench sits to the right."}
{"left": ["dog", "tree"], "down": ["person", "bike"], "up": ["house", "power line"], "right": ["parking meter", "street sign"], "description": "In the distance, a house and power line stretch along the horizon. Directly in front, a person rides a bike, while a dog is visible to the left near a tree, and a parking meter stands beside a street sign to the right."}
{"left": ["person", "backpack"], "down": ["bicycle"], "up": ["bench", "parking meter"], "right": ["tree", "potted plant"], "description": "In the distance, a bench and parking meter are visible near a park. In front, a bicycle rolls by, with a person walking alongside, carrying a backpack. To the right, a tree and potted plant stand together."}
{"left": ["person", "bicycle"], "down": ["car", "parking meter"], "up": ["traffic light", "skyscraper"], "right": ["bench"], "description": "In the distance, a traffic light and towering skyscraper dominate the scene. Directly in front, a car rolls down the road, with a person riding a bicycle to the left and a bench sits to the right, near a parking meter."}
{"left": ["person", "skateboard"], "down": ["car", "traffic light"], "up": ["parking meter", "bench"], "right": ["bus"], "description": "In the distance, a parking meter and bench are visible. In front, a car stops at the traffic light, near a person who is about to pass with their skateboard. A bus waits to the right."}
{"left": ["person"], "down": ["car"], "up": ["airplane"], "right": ["tree", "parking meter"], "description": "In the distance, an airplane soars above the landscape. In front, a car moves steadily, with a person to the left, and a tree and parking meter stand to the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bicycle", "bus"], "description": "A traffic light appears in the distance. Directly in front, a person and car move steadily, while a bicycle sits beside a bus on the right, and a bird takes flight nearby."}
{"left": ["bird"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light towers above the scene. Directly in front, a person is walking towards their car, with a bird flying overhead and a bicycle parked to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "fire hydrant"], "right": ["parking meter"], "description": "A traffic light and fire hydrant appear in the distance, while directly in front, a car and bus move steadily down the road. To the left, a person holds an umbrella, and a parking meter sits to the right."}
{"left": ["person"], "down": ["car"], "up": ["airplane"], "right": ["tree", "potted plant"], "description": "An airplane floats above in the distance. Directly in front, a car moves steadily, with a person to the left."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["airplane", "cloud"], "right": ["traffic light"], "description": "An airplane flies in the distance amidst light clouds. Directly in front, a car and bus move, while a person shields themselves with an umbrella to the left, and a traffic light stands to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["mountain", "airplane"], "right": ["parking meter", "bench"], "description": "In the distance, a mountain and airplane are seen in the sky. A person and car are in front, with a bird to the left and a parking meter and bench to the right."}
{"left": ["person", "umbrella"], "down": ["car", "traffic light"], "up": ["skyscraper", "giraffe (at a zoo)"], "right": ["bicycle"], "description": "In the distance, a skyscraper and a giraffe at a zoo are visible. Directly in front, a car and traffic light are clearly seen, while a person holds an umbrella to the left and a bicycle rides by to the right."}
{"left": ["person"], "down": ["car"], "up": ["airplane"], "right": ["traffic light", "parking meter"], "description": "In the distance, an airplane soars above. Directly in front, a car moves steadily, while a person is visible to the left, and a traffic light and parking meter sit to the right."}
{"left": ["person"], "down": ["car", "parking meter"], "up": ["traffic light", "bus"], "right": ["bench"], "description": "In the distance, a traffic light and bus are visible. At the curb, a person is stopped next to a parking meter, while a car is parked nearby. To the left, the person is visible, and a bench sits to the right."}
{"left": ["person"], "down": ["car", "bike rack"], "up": ["airplane", "cloud"], "right": ["parking meter", "bench"], "description": "In the distance, an airplane flies by a cloud. Directly in front of the car, a bike rack is attached to the side. To the left, a person is waiting for a ride, while a parking meter and bench sit to the right."}
{"left": ["cat", "chair"], "down": ["dog", "car"], "up": ["tree", "potted plant"], "right": ["bench", "umbrella"], "description": "In the distance, a tree and potted plant stand near a house. Directly in front, a car speeds by, with a dog in the nearby yard, to the left a cat lounges on a chair, and to the right a person sits on a bench under an open umbrella."}
{"left": ["bird", "cat"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bike rack", "bicycle"], "description": "In the distance, a traffic light can be seen. Directly in front, a person and car move, while a bird and cat are visible to the left, and a bicycle is secured to a bike rack on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["airplane", "cloud"], "right": ["parking meter", "bench"], "description": "In the distance, an airplane flies above the clouds. Directly in front, a car and bus move steadily, while a person with an umbrella hurries to the left, and a parking meter and bench sit to the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["traffic light", "building"], "right": ["bicycle"], "description": "In the distance, a traffic light and building stand tall. Directly in front, a person walks beside a car, while a bird flies overhead and a bicycle sits to the right."}
{"left": ["bird"], "down": ["person", "skateboard"], "up": ["giraffe", "zoo fence"], "right": ["bench"], "description": "In the distance, a giraffe grazes near a zoo fence, while in the foreground, a person on a skateboard glides across the path, flanked by a bird to the left and a bench to the right."}
{"left": ["person"], "down": ["car", "parking meter"], "up": ["skyscraper", "airplane"], "right": ["bus"], "description": "In the distance, a skyscraper and airplane appear in the sky. Directly in front, a car and parking meter are by the road, while a person walks to the left, and a bus travels down the street to the right."}
{"left": ["traffic light"], "down": ["person", "car"], "up": ["highway", "motorcycle", "truck"], "right": ["bus"], "description": "In the distance, a highway stretches out with a motorcycle and truck on the road ahead. Directly in front, a person and car are visible, while a traffic light stands to the left, and a bus passes by to the right."}
{"left": ["cat", "bench"], "down": ["person", "traffic light"], "up": ["skyscraper", "airplane"], "right": ["car", "potted plant"], "description": "In the distance, a skyscraper and airplane rise above the city. Directly in front, a person and traffic light stand out, while a cat sits on a bench to the left, and a car and potted plant are visible to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light"], "right": ["bike rack", "bicycle"], "description": "A traffic light stands in the distance. Directly in front, a car and bus move steadily, while a person holds an umbrella to the left, and a bicycle leans against a bike rack to the right."}
{"left": ["person", "skateboard"], "down": ["car", "parking meter"], "up": ["traffic light", "bus"], "right": ["umbrella", "bike rack"], "description": "In the distance, a bus and traffic light are visible along the road. Directly in front, a car and parking meter sit by the sidewalk, while a person is skateboarding to the left, and an umbrella leans against a bike rack to the right."}
{"left": ["person", "dog"], "down": ["car", "traffic light", "traffic light"], "up": ["skyscraper"], "right": ["parking meter", "bus"], "description": "In the distance, a skyscraper touches the sky. Directly in front, a traffic light and another traffic light guide traffic, as a car stops near a parking meter and waits to turn. A person and their dog walk to the left, while a bus approaches to the right."}
{"left": ["cat"], "down": ["person", "dog"], "up": ["tree", "giraffe"], "right": ["bench", "umbrella"], "description": "In the distance, a tree and giraffe stand in a park. In front, a person and dog are strolling, while a cat sits to the left, and a bench and person holding an umbrella are visible to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "building"], "right": ["bicycle"], "description": "In the distance, a traffic light and a building appear along the road. Directly in front, a car and bus move steadily, while a person holding an umbrella walks to the left, and a bicycle glides by to the right."}
{"left": ["tree", "person"], "down": ["car", "bicycle"], "up": ["airplane", "cloud"], "right": ["parking meter", "bench"], "description": "An airplane flies high in the distance above a cloud. Near the viewer, a person is standing next to a car and a bicycle, with a tree to the left and a parking meter and bench on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["airplane", "cloud"], "right": ["parking meter"], "description": "In the distance, an airplane soars through the sky above a cloudy horizon. Directly in front, a car and bicycle move steadily, while a person under an umbrella is visible to the left, and a parking meter sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["traffic light", "building"], "right": ["bus", "tree"], "description": "In the distance, a traffic light and a building are seen. In front, a car and a bike move along the road, while a person holds an umbrella to the left, and a bus passes by a tree on the right."}
{"left": ["bike rack", "umbrella"], "down": ["person"], "up": ["airplane"], "right": ["parking meter"], "description": "An airplane is visible in the distance. Directly in front, a person stands, with a bike rack and umbrella visible to the left, and a parking meter to the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["airplane", "cloud"], "right": ["tree"], "description": "An airplane flies high in the distance, amidst a cloud. In front, a person and car are clearly visible, with a bird to the left and a tree to the right."}
{"left": ["cow"], "down": ["person", "dog"], "up": ["horse"], "right": ["bench"], "description": "In the distance, a horse grazes in a nearby field. Directly in front, a person and dog are visible, with a cow standing to the left, and a bench sits nearby."}
{"left": ["bird", "person"], "down": ["car", "bus"], "up": ["traffic light", "building"], "right": ["bicycle", "tree"], "description": "A traffic light and building are visible in the distance. Directly in front, a car and bus move steadily, while a person walks beside a bicycle under a tree to the right, and a bird flies overhead to the left."}
{"left": ["bird"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bicycle", "bus"], "description": "In the distance, a traffic light signals the road. In front, a person and car move through the intersection, with a bird flying overhead to the left and a bicycle and bus passing by to the right."}
{"left": ["bicycle", "person", "backpack"], "down": ["car"], "up": ["traffic light", "building"], "right": ["bus"], "description": "In the distance, a traffic light and building are visible, while a car is directly in front. To the left, a person is riding a bicycle with a backpack, and a bus passes by on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light"], "right": ["bench"], "description": "A traffic light stands in the distance, along the road. In front, a car and bicycle move steadily, while a person is walking to the left, holding an umbrella, and a bench sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["skyscraper"], "right": ["traffic light", "bus"], "description": "In the distance, a skyscraper towers above. In front, a car and bicycle move through the road, while a person walks to the left, holding an umbrella, and a bus approaches a traffic light to the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["airplane"], "right": ["bus"], "description": "In the distance, an airplane flies overhead. Directly in front, a car moves steadily down the road, while a person holds an umbrella to the left, and a bus travels by to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light", "parking meter"], "right": ["bus"], "description": "In the distance, a traffic light and parking meter are visible, near a parking area. In front, a car and bicycle move steadily, while a person with an umbrella stands to the left, and a bus travels to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane"], "right": ["traffic light"], "description": "An airplane flies high in the distance. A car sits in front, while a person walks to the left alongside a bicycle, and a traffic light stands on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["church", "parking meter"], "right": ["bus", "tree"], "description": "A church and parking meter are visible in the distance. Directly in front, a car and bike move steadily, while a person holds an umbrella to the left, and a bus passes by a tree on the right."}
{"left": ["person", "umbrella"], "down": ["car", "parking meter"], "up": ["traffic light"], "right": ["bus"], "description": "In the distance, a traffic light stands tall. Directly in front, a car and parking meter sit, while a person holds an umbrella to the left, and a bus passes by to the right."}
{"left": ["person"], "down": ["car", "bicycle"], "up": ["airplane", "bird"], "right": ["bench"], "description": "In the distance, an airplane flies overhead, accompanied by a bird. In front, a car and bicycle are parked, with a person nearby. To the right, a bench is occupied."}
{"left": ["tree", "umbrella"], "down": ["person", "dog"], "up": ["giraffe", "parking meter"], "right": ["bench"], "description": "In the distance, a giraffe and parking meter appear along the side of the road. Directly in front, a person walks with a dog, while an umbrella stands to the left, and a bench sits to the right."}
{"left": ["person"], "down": ["car", "bicycle"], "up": ["skyscraper", "airplane"], "right": ["motorcycle", "traffic light"], "description": "In the distance, a skyscraper and airplane touch the sky. Directly in front, a car and bicycle move steadily, with a person to the left, and a motorcycle stops beside a traffic light on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "skyscraper"], "right": ["bike lane"], "description": "In the distance, a traffic light and skyscraper rise above. Directly in front, a car and bus move steadily, while a person holds an umbrella to the left, and a bike lane runs along the right side of the road."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["tree", "bird"], "right": ["skateboard"], "description": "In the distance, a tree and bird are visible. Directly in front, a car is driving down the road, with a person holding an umbrella to the left and a skateboarder to the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane"], "right": ["traffic light", "bicycle"], "description": "In the distance, an airplane soars in the sky. Directly in front, a car and bus move steadily along the road below, with a person walking to the left and a bicycle and traffic light on the right."}
{"left": ["person", "bench"], "down": ["car", "traffic light"], "up": ["airplane", "bird"], "right": ["bicycle"], "description": "In the distance, an airplane and bird soar overhead. Directly in front, a car and traffic light are visible, while a person sits on a bench to the left, and a bicycle is parked to the right."}
{"left": ["bird", "person"], "down": ["car", "bus"], "up": ["airplane", "cloud"], "right": ["traffic light", "parking meter"], "description": "In the distance, an airplane rises above the clouds. Directly in front, a car and bus navigate a busy road, while a person is visible to the left. Nearby, a traffic light and parking meter frame the scene to the right."}
{"left": ["person", "dog"], "down": ["car", "bike rack"], "up": ["house", "tree"], "right": ["parking meter", "umbrella"], "description": "A house and tree are visible in the distance. Directly in front, a car is parked, with a bike rack beside it, while a person walks to the left, and a parking meter and person under an umbrella sit to the right."}
{"left": ["person"], "down": ["car", "fire hydrant"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light hangs over the road. Directly in front, a car slows down near a fire hydrant, while a person walks to the left and a bicycle cruises by to the right."}
{"left": ["person", "car"], "down": ["bicycle"], "up": ["traffic light"], "right": ["bus"], "description": "A traffic light appears in the distance. Directly in front, a bicycle glides smoothly, while a person and car are visible to the left, and a bus moves steadily to the right."}
{"left": ["person", "bike"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["traffic light", "bench"], "description": "In the distance, an airplane soars through the sky with fluffy clouds. In front, a car moves steadily down the road, with a person and bike visible to the left and a traffic light and bench to the right."}
{"left": ["tree", "bird"], "down": ["person", "skateboard"], "up": ["church"], "right": ["bench"], "description": "In the distance, a church stands tall. In front, a person rides a skateboard, with a bird perched in a nearby tree to the left and a bench sits to the right."}
{"left": ["person"], "down": ["bike", "dog"], "up": ["house"], "right": ["tree"], "description": "In the distance, a house comes into view. Directly in front, a person is walking, accompanied by a dog, while a bicycle is parked nearby, and a tree stands tall to the right."}
{"left": ["person"], "down": ["car", "parking meter"], "up": ["traffic light"], "right": ["bench", "tree"], "description": "In the distance, a traffic light hangs above the street. In front, a car is parked near a parking meter, with a person visible to the left, and a bench sits beneath a tree to the right."}
{"left": ["person", "dog"], "down": ["car"], "up": ["traffic light"], "right": ["parking meter"], "description": "In the distance, a traffic light stands tall. In front, a car is parked, while a person walks their dog to the left, and a parking meter sits to the right."}
{"left": ["bike lane marking", "bicycle"], "down": ["car", "pedestrian", "traffic light", "bus"], "up": ["high-rise building", "airplane"], "right": ["parking lot", "traffic cone"], "description": "In the distance, a high-rise building and airplane are visible. Directly in front, a person and car navigate through an intersection, while a bicycle and a pedestrian cross the road. A traffic light controls the flow of the bus, and a bike lane marking is seen to the left, with a parking lot and traffic cone on the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["church", "cross"], "right": ["parking meter"], "description": "In the distance, a church and cross appear along the road. Directly in front, a car moves steadily, while a person and bicycle are visible to the left, and a parking meter sits to the right."}
{"left": ["person", "bike"], "down": ["car", "motorcycle"], "up": ["airplane", "airport building"], "right": ["traffic light"], "description": "In the distance, an airplane approaches the airport building. Directly in front, a car and motorcycle move through the airport gates, while a person is walking to the left and a traffic light sits to the right, near the terminal."}
{"left": ["cat", "bird"], "down": ["person", "car", "bicycle"], "up": ["traffic light", "skyscraper"], "right": ["bus"], "description": "A traffic light and skyscraper appear in the distance. In front, a person and car move steadily, with a bicycle beside them, and to the left, a cat and bird coexist peacefully. A bus drives by to the right."}
{"left": ["person", "bike"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["bench"], "description": "In the distance, an airplane flies across the sky and white clouds are visible. A car moves steadily in front, with a person riding a bike to the left, and a bench sits to the right, enjoying the view."}
{"left": ["person"], "down": ["car", "bus"], "up": ["traffic light", "building"], "right": ["bicycle"], "description": "In the distance, a traffic light on a building stands tall. Directly in front, a car and bus are stopped, while a person is walking towards them, and a bicycle is parked to the right."}
{"left": ["tree", "person"], "down": ["car", "backpack"], "up": ["airplane", "cloud"], "right": ["bench", "umbrella"], "description": "In the distance, an airplane flies across the sky with a cloud nearby. Directly in front, a car travels down the road while a person walks, carrying a backpack, with a tree to the left and a bench beside an umbrella to the right."}
{"left": ["horse"], "down": ["person", "backpack"], "up": ["mountain", "hot air balloon"], "right": ["bike"], "description": "A hot air balloon and mountain stand in the distance. In front, a person with a backpack walks, with a horse to the left, and a bike on the right path."}
{"left": ["person", "bicycle"], "down": ["car", "bus"], "up": ["bird", "parking meter"], "right": ["frisbee", "umbrella"], "description": "In the distance, a bird perches on a parking meter. Directly in front, a car and bus move steadily, while a person and bicycle are visible to the left, and a frisbee and umbrella sit to the right."}
{"left": ["bird", "person"], "down": ["car", "bus"], "up": ["church", "tree"], "right": ["bench"], "description": "In the distance, a church and tree line the horizon. Directly in front, a car and bus move steadily, while a bird and person are visible to the left, and a bench sits to the right, under the shade of the same tree."}
{"left": ["person", "skateboard"], "down": ["car", "parking meter"], "up": ["stop sign", "tree"], "right": ["bench", "potted plant"], "description": "A stop sign and tree are visible in the distance. In front, a car was parked near a parking meter, with a person and skateboard beside it, and a bench and potted plant to the right."}
{"left": ["person", "bird"], "down": ["car"], "up": ["airplane"], "right": ["bus"], "description": "In the distance, an airplane flies overhead. Directly in front, a car moves steadily, while a person and bird are visible to the left, and a bus stops to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["bench", "potted plant"], "right": ["parking meter"], "description": "In the distance, a bench and a potted plant are visible. Directly in front, a person and car move along the road, while a bird perches on a nearby tree to the left, and a parking meter sits to the right."}
{"left": ["person"], "down": ["car"], "up": ["mountain", "clouds"], "right": ["tree", "bench"], "description": "A mountain and clouds are seen in the distance. In front, a car moves steadily. A person walks to the left, while a tree and bench sit to the right."}
{"left": ["bird"], "down": ["car", "person"], "up": ["traffic light"], "right": ["bus", "bicycle"], "description": "In the distance, a traffic light appears on a pole. Directly in front, a car and person move steadily, with a bird flying overhead to the left, and a bus and bicycle moving along the road to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light"], "right": ["parking meter", "handbag"], "description": "In the distance, a traffic light is visible. Directly in front, a car and bicycle move along the road, while a person stands to the left holding an umbrella, and a parking meter and handbag are visible to the right."}
{"left": ["person", "handbag"], "down": ["car", "bus"], "up": ["traffic light", "parking meter"], "right": ["bench", "umbrella"], "description": "In the distance, a traffic light and parking meter are seen on the street. Directly in front, a car and bus move steadily. A person with a handbag is walking to the left, while a bench sits to the right under a person's umbrella."}
{"left": ["person", "dog"], "down": ["car", "bike"], "up": ["fire hydrant", "parking meter"], "right": ["bench", "tree"], "description": "A fire hydrant and parking meter stand at a distance. Directly in front, a car moves steadily, accompanied by a bicycle, while a person walks with a dog on the left, and a bench and tree sit on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["airplane", "bird"], "right": ["tree", "bench"], "description": "An airplane and bird are seen flying high in the distance. Directly in front, a car and bicycle move alongside each other, while a person, carrying an umbrella, walks to the left and sits on a bench to the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane"], "right": ["traffic light"], "description": "Far in the distance, an airplane soars overhead. Directly in front, a car and bus move steadily, while a person walks to the left, and a traffic light stands on the right."}
{"left": ["person"], "down": ["car", "bike"], "up": ["airplane"], "right": ["parking meter"], "description": "In the distance, an airplane soars through the sky. Directly in front, a car and a bike are parked on the side of the road, with a person nearby and a parking meter to the right."}
{"left": ["person", "dog"], "down": ["car", "bicycle"], "up": ["traffic light", "building"], "right": ["parking meter"], "description": "In the distance, a traffic light and a building appear. Directly in front, a car and bicycle are visible, near a person walking with their dog, while a parking meter sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light"], "right": ["bicycle", "potted plant"], "description": "In the distance, a traffic light stands tall. Directly in front, a car and bus move steadily, with a person and umbrella to the left, and a bicycle and a potted plant on the right."}
{"left": ["person", "bicycle"], "down": ["car", "traffic light"], "up": ["airplane", "mountain"], "right": ["tree"], "description": "An airplane flies in the distance over a mountain range. Directly in front, a car and traffic light are at a busy intersection, while a person and bicycle are to the left, and a lone tree sits to the right."}
{"left": ["tree", "person"], "down": ["car", "pedestrian"], "up": ["mountain", "building"], "right": ["bench", "parking meter"], "description": "In the distance, a mountain and building are visible. Directly in front, a car and pedestrian are near the road, while a person walks beside a tree to the left, and a bench and parking meter sit to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane"], "right": ["fire hydrant", "stop sign"], "description": "An airplane flies far off in the distance. A car is directly in front, while a person pedals a bicycle to the left. A fire hydrant and stop sign stand together to the right."}
{"left": ["person"], "down": ["car", "bicycle"], "up": ["airplane"], "right": ["tree", "bench"], "description": "In the distance, an airplane flies overhead. Directly in front, a car and bicycle are parked, with a person to the left and a tree and bench to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["mountain"], "right": ["bench", "potted plant"], "description": "A mountain stands far away in the distance. In front, a person and car move along the road, with a bird perched nearby to the left, and a bench and potted plant sit to the right."}
{"left": ["person", "dog"], "down": ["car", "traffic light"], "up": ["airplane"], "right": ["bus"], "description": "In the distance, an airplane flies overhead. Directly in front, a car navigates through an intersection with a traffic light, while a person and dog walk together to the left, and a bus travels down the road to the right."}
{"left": ["bird", "tree"], "down": ["person", "car", "bus"], "up": ["church"], "right": ["bench", "parking meter"], "description": "In the distance, a church towers above the landscape. In front, a person walks alongside a car and bus, while a bird is perched to the left and a bench sits next to a parking meter on the right."}
{"left": ["person", "bus"], "down": ["car", "motorcycle"], "up": ["airplane", "traffic light"], "right": ["bench", "umbrella"], "description": "In the distance, an airplane and traffic light are visible. Directly in front, a car and motorcycle speed down the road, while a person walks beside a bus to the left, and a bench and umbrella sit to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["parking meter", "traffic light"], "right": ["bus"], "description": "In the distance, a parking meter and traffic light are visible. Directly in front, a car and bike move steadily, while a person holds an umbrella to the left, and a bus moves by to the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["building", "parking meter"], "right": ["bus"], "description": "In the distance, a building and parking meter stand on the street. Directly in front, a person holding an umbrella walks beside a car, while a bus travels to the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bicycle"], "description": "A traffic light stands in the distance. In front, a person and car are clearly visible, with a bird to the left and a bicycle on the right."}
{"left": ["person"], "down": ["car"], "up": ["airplane", "clouds"], "right": ["traffic light"], "description": "Above, an airplane soars through the sky amidst clouds. Directly in front, a car moves steadily, with a person walking to the left and a traffic light nearby."}
{"left": ["person"], "down": ["car", "traffic light", "bicycle"], "up": ["airplane"], "right": ["motorcycle"], "description": "In the distance, an airplane flies high. Directly in front, a car approaches a traffic light while a bicycle is parked nearby, with a person standing on the sidewalk to the left and a motorcycle on the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["traffic light", "parking meter"], "right": ["bus"], "description": "In the distance, a traffic light and parking meter are clearly visible. Nearby, a car drives by, while a person walks on the sidewalk to the left, and a bus approaches on the right, with an umbrella by their side."}
{"left": ["person"], "down": ["car", "bicycle", "umbrella"], "up": ["traffic light", "bus"], "right": ["parking meter"], "description": "In the distance, a traffic light and bus appear on the street. Directly in front, a car and bicycle move steadily, while a person holds an umbrella nearby, and a parking meter sits to the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["traffic light", "stop sign"], "right": ["bicycle"], "description": "In the distance, a traffic light and stop sign are visible along the road. A person holds an umbrella in front, while a car drives steadily, and a bicycle sits to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane", "bird"], "right": ["tree", "bench"], "description": "In the distance, an airplane and bird fly overhead. Directly in front, a car moves steadily. A person is walking to the left, and a bicycle accompanies them, while a tree and bench sit to the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane"], "right": ["bicycle"], "description": "An airplane is visible in the distance above. Directly in front, a car and bus move steadily, while a person walks to the left and a bicycle rides by on the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["airplane"], "right": ["motorcycle"], "description": "An airplane flies in the distance. In front, a person walks alongside a car, with a bird to the left and a motorcycle on the right."}
{"left": ["bike path", "person"], "down": ["car", "parking meter"], "up": ["skyscraper"], "right": ["bus stop", "bus"], "description": "In the distance, a skyscraper dominates the cityscape. Directly in front, a car and parking meter sit together, while a person walks along the bike path to the left, and a bus stop and bus wait patiently to the right."}
{"left": ["bird", "cat"], "down": ["person", "car"], "up": ["airplane"], "right": ["motorcycle", "bus"], "description": "In the distance, an airplane takes flight. Directly in front, a person drives a car, while a bird sits with a cat to the left, and a motorcycle and bus move alongside to the right."}
{"left": ["bicycle"], "down": ["person", "frisbee"], "up": ["bird", "parking meter"], "right": ["bench"], "description": "In the distance, a bird and parking meter stand near a quiet road. Directly in front, a person sits on a grassy area, playing with a frisbee, while a bicycle is parked to the left, and a bench sits nearby on the right."}
{"left": ["person", "umbrella"], "down": ["bus", "car"], "up": ["traffic light", "building"], "right": ["bike rack", "bicycle"], "description": "A traffic light and building stand in the distance. In front, a bus and car are moving, while a person walks under an umbrella to the left, and a bicycle leans against a bike rack on the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["stop sign", "traffic light"], "right": ["bus", "bicycle"], "description": "A stop sign and traffic light stand in the distance, guiding traffic. In front, a person and car approach, with a bird perched nearby to the left. A bus and bicycle move steadily on the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["bench"], "description": "In the distance, an airplane flies above a cluster of clouds. Directly in front, a car moves steadily, while a person and bicycle are visible to the left, and a bench sits to the right."}
{"left": ["person", "skateboard"], "down": ["car", "dog"], "up": ["traffic light"], "right": ["bicycle"], "description": "A traffic light stands in the distance. Directly in front, a car moves steadily, with a person on a skateboard to the left, and a bicycle on the right, while a dog is visible nearby."}
{"left": ["cat", "potted plant"], "down": ["person", "dog"], "up": ["house"], "right": ["bike rack", "skateboard"], "description": "In the distance, a house is visible. Directly in front, a person and dog are walking, with a cat nearby a potted plant to the left, and a bike rack and skateboard sitting on the right."}
{"left": ["tree", "person"], "down": ["car", "potted plant"], "up": ["house", "bird"], "right": ["bench", "umbrella"], "description": "In the distance, a house and bird are visible, while a person walks alongside a tree to the left, and a car is parked near a potted plant in front, with a bench and umbrella to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["airplane", "cloud"], "right": ["traffic light", "tree"], "description": "In the distance, an airplane flies through the sky among clouds. Directly in front, a car and bus move steadily, while a person holds an umbrella to the left, and a traffic light and tree stand to the right, which could be near a residential area."}
{"left": ["person"], "down": ["car", "bicycle"], "up": ["traffic light", "high-rise building"], "right": ["parking meter"], "description": "In the distance, a traffic light and a high-rise building stand tall. Directly in front, a car and bicycle move along the road, with a person walking to the left, and a parking meter nearby."}
{"left": ["person", "bike rack"], "down": ["car", "motorcycle"], "up": ["traffic light", "high-rise building"], "right": ["skateboard"], "description": "In the distance, a traffic light stands at the intersection, and a high-rise building rises above. In front, a car and motorcycle drive down the road, with a person next to a bike rack to the left, and a skateboarder glides by on the right."}
{"left": ["cat", "backpack"], "down": ["person", "dog", "car"], "up": ["building", "tree"], "right": ["bike rack", "umbrella"], "description": "In the distance, a building and tree stand tall. Directly in front, a person holds a dog, and drives a car, with a cat and backpack visible to the left, and a bike rack and umbrella sit to the right."}
{"left": ["person", "umbrella"], "down": ["car", "motorcycle"], "up": ["traffic light", "building"], "right": ["bus"], "description": "In the distance, a traffic light and building appear along the road, while a car and motorcycle speed by in front. A person holding an umbrella walks beside the road, and a bus travels to the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane", "cloud"], "right": ["bicycle"], "description": "In the distance, an airplane flies through the sky above white clouds. Directly in front, a car and bus are seen moving along the road, while a person is visible to the left and a bicycle is parked to the right."}
{"left": ["tree", "person"], "down": ["dog", "parking meter"], "up": ["building", "car"], "right": ["bench", "umbrella"], "description": "In the distance, a building and car appear. Directly in front, a dog and parking meter catch attention, while a person walks to the left, and a bench and person under an umbrella are visible to the right."}
{"left": ["person", "umbrella"], "down": ["car", "parking meter"], "up": ["traffic light", "skyscraper"], "right": ["bicycle", "tree"], "description": "In the distance, a traffic light and a skyscraper can be seen. Directly in front, a car and a parking meter are visible, while a person holds an umbrella to the left, and a bicycle is parked beside a tree on the right."}
{"left": ["person", "dog"], "down": ["car", "bike"], "up": ["airplane"], "right": ["traffic light"], "description": "In the distance, an airplane takes flight. Directly in front, a car and bike move steadily, with a person and dog walking side by side to the left, and a traffic light guiding traffic to the right."}
{"left": ["bird", "tree"], "down": ["person", "car", "bench"], "up": ["mountain"], "right": ["bicycle", "bus"], "description": "A mountain stands in the distance. Directly in front, a person sits on a bench, with a car parked nearby, while a bicycle and bus move steadily to the right, and a bird perched on a nearby tree to the left."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "high-rise building"], "right": ["bike rack", "bench"], "description": "A traffic light and high-rise building appear in the distance. Directly in front, a car and bus drive along the road, while a person walking on the sidewalk holds an umbrella to the left, and a bike rack and bench sit to the right."}
{"left": ["person", "dog"], "down": ["car", "motorcycle"], "up": ["airplane", "clouds"], "right": ["building", "tree"], "description": "An airplane flies in the distant sky near clouds. On the road below, a car and motorcycle move forward, while a person walks beside a dog to the left, and a building and tree stand on the right."}
{"left": ["tree", "bench"], "down": ["person", "dog"], "up": ["house", "power line"], "right": ["parking meter", "car"], "description": "In the distance, a house and power line are seen, while a person and dog walk in front. A parking meter and car sit to the right, near a tree and bench to the left."}
{"left": ["person"], "down": ["car"], "up": ["airplane", "giraffe"], "right": ["parking meter"], "description": "An airplane and giraffe appear in the distance. Directly in front, a car moves steadily, with a person walking to the left and a parking meter to the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["airplane"], "right": ["tree", "bench"], "description": "An airplane is seen in the distance. In front, a car drives steadily, while a person with an umbrella walks to the left, and a tree and bench sit to the right."}
{"left": ["bird", "tree"], "down": ["person", "potted plant"], "up": ["bench"], "right": ["car", "parking meter"], "description": "A bench sits in the distance. Directly in front, a person stands near a potted plant, while a bird is visible to the left and a car and parking meter sit to the right."}
{"left": ["person", "handbag"], "down": ["car", "potted plant"], "up": ["skyscraper"], "right": ["parking meter", "bicycle"], "description": "A skyscraper towers in the distance. In front, a car moves steadily past a potted plant, while a person with a handbag walks to the left, and a bicycle and parking meter sit to the right."}
{"left": ["cat", "tree"], "down": ["person"], "up": ["house", "power line"], "right": ["car"], "description": "In the distance, a house and power line stand against the sky. Directly in front, a person is walking down the sidewalk, with a cat lounging in a nearby tree to the left, and a car passing by on the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["traffic light"], "right": ["bus"], "description": "A traffic light stands in the distance. Directly in front, a car moves steadily, while a person holds an umbrella to the left, and a bus passes by on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "tower"], "right": ["bench", "potted plant"], "description": "In the distance, a traffic light and tower appear along the road. Directly in front, a car and bus move steadily, while a person holds an umbrella to the left, and a bench with a potted plant sits to the right."}
{"left": ["person", "handbag", "umbrella"], "down": ["car", "bus"], "up": ["skyscraper", "airplane"], "right": ["bike rack", "parking meter"], "description": "In the distance, a skyscraper and airplane dominate the skyline. Directly in front, a car and bus move steadily, while a person walks to the left, carrying a handbag and umbrella, and a bike rack sits beside a parking meter on the right."}
{"left": ["bird", "person"], "down": ["car"], "up": ["traffic light"], "right": ["bicycle", "bus"], "description": "In the distance, a traffic light can be seen. A person walks along the sidewalk to the left, with a bird perched nearby. Directly in front, a car moves steadily. A bicycle and bus sit to the right."}
{"left": ["bird", "tree"], "down": ["person", "backpack", "umbrella"], "up": ["mountain", "hike trail"], "right": ["car", "parking meter"], "description": "A mountain with a hike trail stands in the distance. In front, a person walks with a backpack and umbrella. A bird is seen to the left, and to the right, a car is parked near a parking meter."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane", "cloud"], "right": ["bicycle"], "description": "In the distance, an airplane flies high in the sky, with a cloud nearby. Directly in front, a car and bus move steadily, while a person is visible to the left, and a bicycle rides on the right."}
{"left": ["person"], "down": ["car", "motorcycle"], "up": ["traffic light", "fire hydrant"], "right": ["bike rack", "backpack"], "description": "A traffic light and fire hydrant appear in the distance. Directly in front, a car and motorcycle speed by, with a person walking to the left and a bike rack holding a backpack on the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["airplane", "cloud"], "right": ["bicycle", "bus"], "description": "In the distance, an airplane flies across the sky, near a white cloud. A person and car are in front, with a bird perched nearby, and a bicycle and bus on the right side."}
{"left": ["cat", "tree"], "down": ["person", "dog"], "up": ["house"], "right": ["bench"], "description": "In the distance, a house stands prominently. Directly in front, a person and dog are strolling, while a cat rests under a nearby tree to the left, and a bench sits to the right."}
{"left": ["person", "bench"], "down": ["car", "pedestrian"], "up": ["traffic light", "skyscraper"], "right": ["bus", "tree"], "description": "High in the distance, a traffic light and tall skyscraper rise above the city. Directly in front, a car and pedestrian walk, while a person sits on a bench to the left, and a bus travels along the road to the right, with a tree standing nearby."}
{"left": ["person", "backpack"], "down": ["car", "traffic light"], "up": ["building", "airplane"], "right": ["parking meter"], "description": "In the distance, a building and airplane are visible. Directly in front, a car and traffic light stop traffic, while a person with a backpack is walking to the left, and a parking meter sits to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane", "traffic light", "stop sign"], "right": ["parking meter", "umbrella"], "description": "In the distance, an airplane soars above, accompanied by a traffic light and stop sign. Nearby, a car moves steadily, while a person and bicycle are visible to the left, and a parking meter and umbrella sit to the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["airplane"], "right": ["bicycle"], "description": "In the distance, an airplane soars overhead. In front, a person walks along the road with a car behind, while a bird flies overhead to the left, and a bicycle travels nearby to the right."}
{"left": ["bird", "tree"], "down": ["person", "car", "bus"], "up": ["mountain"], "right": ["parking meter"], "description": "In the distance, a mountain rises above the horizon. In front, a person walks along the road, passing a car and a bus, while a bird flies overhead to the left, and a parking meter stands on the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light guides road traffic. Directly in front, a person is walking, with a car moving steadily, and a bird flying overhead to the left, while a bicycle rides by on the right."}
{"left": ["person"], "down": ["car", "umbrella"], "up": ["airplane"], "right": ["parking meter", "bus"], "description": "In the distance, an airplane flies overhead. Under the rain, a car moves steadily, with a person holding an umbrella, while a parking meter stands to the right and a bus passes by."}
{"left": ["person", "umbrella"], "down": ["car", "motorcycle"], "up": ["airplane", "cloud"], "right": ["traffic light", "bus"], "description": "In the distance, an airplane soars above, with puffy clouds nearby. Directly in front, a car and motorcycle move along the road, while a person holds an umbrella to the left, and a traffic light stands beside a bus on the right."}
{"left": ["person", "bicycle"], "down": ["car", "dog"], "up": ["traffic light"], "right": ["bench", "tree"], "description": "In the distance, a traffic light hangs above the road. Directly in front, a car moves steadily, while a person rides a bicycle to the left, and a dog waits on the sidewalk. A bench sits to the right, beneath a nearby tree."}
{"left": ["bird"], "down": ["person", "car"], "up": ["mountain", "hot air balloon"], "right": ["bicycle"], "description": "A hot air balloon and mountain are visible in the distance. In front, a person and car are clearly visible, with a bird to the left and a bicycle on the road to the right."}
{"left": ["bird"], "down": ["person", "bicycle"], "up": ["traffic light", "airplane"], "right": ["car"], "description": "An airplane soars in the distance, accompanied by a traffic light. Directly in front, a person is walking with a bicycle, while a bird flies overhead, and a car moves steadily to the right."}
{"left": ["person", "bike rack"], "down": ["car", "pedestrian"], "up": ["high-rise building", "airplane"], "right": ["bus stop", "bus"], "description": "In the distance, a high-rise building and airplane soar above. A car and pedestrian are directly in front, while a person leans against a bike rack to the left, and a bus pulls up to the bus stop on the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["airplane"], "right": ["bicycle"], "description": "In the distance, an airplane soars overhead. In front, a person and car are clearly visible, with a bird flying to the left and a bicycle on the right."}
{"left": ["person", "bike"], "down": ["car", "bus"], "up": ["building", "tree"], "right": ["parking meter", "umbrella"], "description": "In the distance, a building and tree stand out. Directly in front, a car and bus move steadily, while a person is walking to the left and a bike is parked near a parking meter and umbrella to the right."}
{"left": ["person"], "down": ["car", "traffic light"], "up": ["building"], "right": ["bicycle", "parking meter"], "description": "A building stands in the distance. Directly in front, a traffic light and car occupy the space, while a person walks to the left, and a bicycle and parking meter are visible to the right."}
{"left": ["person", "car"], "down": ["bicycle", "bird"], "up": ["airplane", "clouds"], "right": ["tree", "parking meter"], "description": "In the distance, an airplane flies overhead, near fluffy clouds. In front, a bicycle and bird are in motion, while a person and car pass to the left, and a tree and parking meter sit to the right."}
{"left": ["person"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["bench"], "description": "In the distance, an airplane flies high above, and a cloud floats nearby. A person is walking on the sidewalk to the left, while a car sits directly in front, and a bench rests on the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane"], "right": ["traffic light"], "description": "In the distance, an airplane flies overhead. Directly in front, a car and bus move steadily, while a person is visible to the left, and a traffic light sits to the right."}
{"left": ["person", "skateboard"], "down": ["car", "bus"], "up": ["traffic light", "airplane"], "right": ["bench", "tree"], "description": "In the distance, an airplane and traffic light are visible above the street scene. Directly in front, a car and bus move steadily, while a person is skateboarding to the left, and a bench sits under a tree to the right."}
{"left": ["person", "backpack"], "down": ["car"], "up": ["airplane", "clouds"], "right": ["traffic light"], "description": "An airplane and fluffy clouds appear on the horizon. Directly in front, a car speeds by, while a person with a backpack walks alongside on the left, and a traffic light sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["traffic light", "building"], "right": ["parking meter"], "description": "A traffic light and building appear in the distance. Directly in front, a car and bike are moving, while a person holds an umbrella to the left, and a parking meter sits to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["mountain", "house"], "right": ["bench", "potted plant"], "description": "In the distance, a mountain and house are visible, with a bird perched on a nearby tree. Directly in front, a person and car approach, while a bench sits to the right and a potted plant is by the person's side."}
{"left": ["person", "umbrella"], "down": ["car", "motorcycle"], "up": ["cat", "bird"], "right": ["traffic light"], "description": "In the distance, a cat and bird perched in a tree are visible. In front of us, a car and motorcycle move steadily along the road, while a person holds an umbrella to the left and a traffic light stands tall on the right."}
{"left": ["umbrella"], "down": ["person", "handbag"], "up": ["office building", "chair"], "right": ["car", "traffic light"], "description": "In the distance, an office building and a chair on the balcony are visible. Directly in front, a person walks down the street, accompanied by a handbag, while an umbrella sits to the left and a car and traffic light to the right."}
{"left": ["person", "car"], "down": ["bus", "bicycle"], "up": ["airplane", "airport building"], "right": ["parking meter"], "description": "In the distance, an airplane soars above an airport building. Directly in front, a bus and bicycle move steadily, while a person sits beside a car to the left, and a parking meter sits to the right."}
{"left": ["person", "skateboard"], "down": ["car", "bike rack"], "up": ["parking meter", "fire hydrant"], "right": ["bench"], "description": "In the distance, a parking meter and fire hydrant are seen. Directly in front, a car is parked with a bike rack attached, while a person is skateboarding to the left, and a bench sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light appears. Directly in front, a car and bus move steadily, while a person holds an umbrella to the left, and a bicycle sits to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane"], "right": ["traffic light"], "description": "Up in the sky, an airplane soars above. Directly in front, a car moves steadily. A person and bicycle are visible to the left, while a traffic light sits to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["bus"], "description": "In the distance, an airplane flies by amidst the clouds. Directly in front, a car moves steadily. To the left, a person and bicycle are visible, and a bus sits to the right."}
{"left": ["person"], "down": ["car", "bike rack"], "up": ["highway sign", "airplane"], "right": ["motorcycle"], "description": "In the distance, an airplane flies overhead and a highway sign helps guide traffic. Directly in front, a car is parked near a bike rack, while a person is visible to the left and a motorcycle speeds by to the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light is visible. A person is walking in front, accompanied by a car, while a bird perches to the left and a bicycle rides by on the right."}
{"left": ["person", "bicycle"], "down": ["car", "bird"], "up": ["traffic light", "skyscraper"], "right": ["bus"], "description": "In the distance, a traffic light and skyscraper are seen. Directly in front, a car moves steadily, while a person is walking near a bicycle on the left, and a bus passes by on the right, with a bird perched nearby."}
{"left": ["person", "dog"], "down": ["car"], "up": ["parking meter", "bench"], "right": ["bus"], "description": "In the distance, a parking meter and bench are visible. Directly in front, a car is stopped, while a person is walking near a dog to the left, and a bus moves steadily to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light", "building"], "right": ["bench", "potted plant"], "description": "In the distance, a traffic light atop a building appears. Directly in front, a car and bicycle move steadily, while a person walks by with an umbrella to the left, and a bench sits beside a potted plant to the right."}
{"left": ["person", "car"], "down": ["bicycle"], "up": ["traffic light", "building"], "right": ["fire hydrant"], "description": "In the distance, a traffic light and building rise above the street. Directly in front, a bicycle moves steadily, while a person is visible to the left, and a fire hydrant sits to the right near a parked car."}
{"left": ["person", "dog"], "down": ["car", "bicycle"], "up": ["traffic light", "parking meter"], "right": ["bus", "umbrella"], "description": "A traffic light and a parking meter appear in the distance. Directly in front, a car and bicycle move along the road, with a person and dog walking to the left and a bus under an umbrella to the right."}
{"left": ["tree", "person"], "down": ["bike", "car"], "up": ["church", "flag"], "right": ["potted plant", "bench"], "description": "In the distance, a church and flag stand tall. Directly in front, a car and bike move steadily, while a person is walking to the left, and a bench and potted plant sit to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "skyscraper"], "right": ["bike lane", "parking meter"], "description": "A traffic light and a tall skyscraper are visible in the distance. In front, a car and bus move steadily, while a person with an umbrella stands to the left, and a bike lane with a nearby parking meter sits to the right."}
{"left": ["person", "skateboard"], "down": ["car", "bus"], "up": ["airplane"], "right": ["stop sign"], "description": "In the distance, an airplane soars. Directly in front, a car and bus move steadily, while a person on a skateboard is visible to the left, and a stop sign stands to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["traffic light", "tree"], "description": "In the distance, an airplane soars through the sky above a cloud. A person and bicycle ride by a car in front, while a traffic light and tree stand to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["mountain"], "right": ["bench"], "description": "A mountain appears in the distance. In front, a person and car move along the road, with a bird to the left and a bench sits to the right, near a tree."}
{"left": ["cat", "person"], "down": ["car", "bicycle"], "up": ["traffic light", "fire hydrant"], "right": ["bus", "tree"], "description": "A traffic light and fire hydrant are visible in the distance. Directly in front, a car and bicycle are parked, with a person to the left and a bus passing by a tree on the right."}
{"left": ["cat", "bird"], "down": ["person", "car"], "up": ["tree", "house"], "right": ["bench", "umbrella"], "description": "A tree and house appear in the distance. In front, a person and car move along the road, with a cat and bird to the left, and a bench near an umbrella on the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane"], "right": ["traffic light", "bus"], "description": "In the distance, an airplane flies above. In front, a car travels steadily, while a person and bicycle are visible to the left, and a traffic light and bus sit to the right."}
{"left": ["bird", "umbrella"], "down": ["person", "car"], "up": ["stop sign"], "right": ["bus"], "description": "A stop sign stands in the distance. A person and car are directly in front, with a bird to the left under an umbrella, and a bus to the right."}
{"left": ["person", "bench"], "down": ["car", "bus"], "up": ["airplane", "tree"], "right": ["traffic light", "skyscraper"], "description": "In the distance, an airplane flies by a tree. Directly in front, a car and bus move steadily, while a person sits beside a bench to the left, and a traffic light and skyscraper stand to the right."}
{"left": ["dog", "tree"], "down": ["person", "umbrella"], "up": ["house", "bench"], "right": ["car", "parking meter"], "description": "In the distance, a house and a bench are visible. In front, a person holds an umbrella, with a dog sitting to the left beside a tree, and a car parked next to a parking meter on the right."}
{"left": ["person", "backpack"], "down": ["bicycle"], "up": ["airplane", "cloud"], "right": ["bench", "tree"], "description": "An airplane flies high in the distance, with a white cloud nearby. Directly in front, a person on a bicycle moves steadily, while a bench sits to the right near a tree."}
{"left": ["dog", "cat"], "down": ["person", "car", "bus"], "up": ["traffic light", "building"], "right": ["parking meter", "umbrella"], "description": "In the distance, a traffic light and building can be seen, while a person and car are directly in front, with a bus driving by. To the left, a dog and cat are sitting on the sidewalk, and a parking meter sits to the right, where someone has left an umbrella."}
{"left": ["person"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["tree", "bird"], "description": "In the distance, a plane flies in the sky near some clouds. Directly in front, a car moves steadily, while a person stands to the left, and a tree and a bird are visible to the right."}
{"left": ["person", "skateboard"], "down": ["car", "traffic light"], "up": ["parking meter", "trees"], "right": ["bench", "potted plant"], "description": "In the distance, a parking meter and trees are visible. Directly in front, a car stops at a traffic light, while a person walks by on the left, holding a skateboard, and a bench sits beside a potted plant on the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["traffic light"], "right": ["motorcycle"], "description": "In the distance, a traffic light is visible. In front, a car moves steadily. A person stands to the left under an umbrella, with a motorcycle on the right."}
{"left": ["person"], "down": ["car", "tree", "bicycle"], "up": ["church", "parking meter"], "right": ["bus"], "description": "A church and a parking meter appear in the distance. Directly in front, a tree and a bicycle are near a car, with a person walking to the left, and a bus moving steadily to the right."}
{"left": ["person", "umbrella"], "down": ["car", "traffic light"], "up": ["building", "skyscraper"], "right": ["bike rack", "bench"], "description": "In the distance, a building and skyscraper dominate the horizon. Directly in front, a car and traffic light are situated, while a person holds an umbrella to the left, and a bike rack and bench sit to the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["traffic light", "skyscraper"], "right": ["bus"], "description": "In the distance, a traffic light and a tall skyscraper mark the cityscape. Directly in front, a car moves steadily, while a person holding an umbrella walks to the left, and a bus passes by on the right."}
{"left": ["person", "bicycle"], "down": ["car", "bus", "traffic light"], "up": ["airplane"], "right": ["parking meter"], "description": "In the distance, an airplane takes flight. In front, a traffic light and bus, with a car beside it, are visible, while a person pedals a bicycle to the left, and a parking meter sits to the right."}
{"left": ["chair", "potted plant"], "down": ["person", "handbag"], "up": ["fire hydrant", "parking meter"], "right": ["bench"], "description": "In the distance, a fire hydrant and parking meter stand along the sidewalk. Directly in front, a person and handbag are visible, with a chair and potted plant to the left, and a bench adjacent to them on the right."}
{"left": ["cat", "umbrella"], "down": ["person", "bike"], "up": ["bus", "building"], "right": ["traffic light", "tree"], "description": "In the distance, a bus and building can be seen. Directly in front, a person rides a bike, with a cat and umbrella to the left, and a traffic light and tree to the right."}
{"left": ["bird", "tree"], "down": ["horse", "person"], "up": ["horse trailer", "mountain"], "right": ["bridge", "car"], "description": "In the distance, a horse trailer is parked near a mountain. Directly in front, a horse and person are visible, with a bird perched on a nearby tree to the left, and a car driving across a bridge on the right."}
{"left": ["bird", "tree"], "down": ["person", "car", "parking meter"], "up": ["skyscraper"], "right": ["bench"], "description": "In the distance, a skyscraper towers above. Directly in front, a person and car are visible, with a bird nearby, a parking meter beside them, and a bench to the right."}
{"left": ["person", "umbrella"], "down": ["car", "backpack"], "up": ["traffic light"], "right": ["bus"], "description": "In the distance, a traffic light hangs above the road. Directly in front, a car moves steadily, while a person walks to the left under an umbrella, and a bus passes by on the right."}
{"left": ["person"], "down": ["car", "bicycle"], "up": ["airplane", "bird"], "right": ["parking meter"], "description": "In the distance, a plane and bird are visible in the sky. Directly in front, a car and bicycle are parked next to each other, with a person standing to the left and a parking meter nearby."}
{"left": ["tree", "person"], "down": ["car", "cycle path"], "up": ["bench", "parking meter"], "right": ["dog"], "description": "In the distance, a bench and parking meter are seen, with a person walking to the left. A car is in front, and a cycle path is beside it. To the right, a dog is walking by."}
{"left": ["person", "bench"], "down": ["car", "bus"], "up": ["traffic light", "fire hydrant"], "right": ["umbrella", "handbag"], "description": "In the distance, a traffic light and fire hydrant stand near the road. In front, a car and bus move steadily, while a person sits on a bench to the left, and an umbrella and handbag are dropped on the right."}
{"left": ["cat", "bench"], "down": ["car", "person"], "up": ["stop sign", "traffic light"], "right": ["umbrella", "parking meter"], "description": "In the distance, a stop sign and traffic light stand on the road. Directly in front, a car and person are visible, with a cat to the left on a bench, and an umbrella beside a parking meter on the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["traffic light", "train"], "right": ["bicycle", "umbrella"], "description": "In the distance, a traffic light and train appear along the road, under an umbrella held by a person to the left. Directly in front, a car and bus move steadily."}
{"left": ["bird", "tree"], "down": ["dog", "person", "potted plant"], "up": ["mountain"], "right": ["house"], "description": "In the distance, a mountain rises high. Directly in front, a person and their dog sit by a potted plant, while a bird flutters around to the left and a house stands to the right."}
{"left": ["tree", "person"], "down": ["car", "bicycle"], "up": ["house", "mountain"], "right": ["bench", "umbrella"], "description": "In the distance, a house and mountain rise above the landscape. Directly in front, a car and bicycle move steadily, while a person walks to the left, and a bench sits under an umbrella to the right."}
{"left": ["person", "backpack", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "parking meter"], "right": ["bicycle"], "description": "In the distance, a traffic light and parking meter are visible, likely near a street. Directly in front, a car and bus move steadily. A person with a backpack and umbrella walks to the left, while a bicycle passes to the right."}
{"left": ["person", "bicycle"], "down": ["car", "motorcycle"], "up": ["airplane", "traffic light"], "right": ["bus"], "description": "In the distance, an airplane soars above, passing a traffic light. Directly in front, a car and motorcycle move, while a person and bicycle are visible to the left, and a bus sits to the right."}
{"left": ["person", "parking meter"], "down": ["car"], "up": ["traffic light", "building"], "right": ["bus"], "description": "In the distance, a traffic light and a building are noticeable. Directly in front, a car stops, and to the left, a person stands near a parking meter. A bus drives by to the right."}
{"left": ["person"], "down": ["car", "motorcycle"], "up": ["skyscraper"], "right": ["traffic light", "bench"], "description": "In the distance, a towering skyscraper can be seen. Directly in front, a car and motorcycle rush by, with a person walking to the left and a traffic light and bench sitting to the right."}
{"left": ["person"], "down": ["car", "traffic light"], "up": ["airplane", "cloud"], "right": ["bus"], "description": "An airplane is visible in the distance, flying high above the clouds. Directly in front, a car and traffic light are clearly seen. To the left, a person stands on the sidewalk, while a bus travels by on the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["bus"], "description": "An airplane flies high in the sky with a few clouds nearby. Directly in front, a car moves steadily. A person rides a bicycle to the left, and a bus travels on the right."}
{"left": ["person", "pedestrian zone sign"], "down": ["car", "traffic light"], "up": ["airplane", "cloud"], "right": ["bicycle", "parking meter"], "description": "An airplane soars in the sky, with a few clouds surrounding it. In front, a traffic light guides traffic, and a car moves steadily, while a person crosses the street to the left, where a pedestrian zone sign is visible, and a bicycle is parked next to a parking meter on the right."}
{"left": ["person"], "down": ["car", "motorcycle"], "up": ["airplane", "airport building"], "right": ["bicycle"], "description": "In the distance, an airplane lands at the airport, with a building visible beside it. In front, a car and motorcycle speed by, while a person is walking to the left, and a bicycle rolls by on the right."}
{"left": ["cat"], "down": ["car", "person"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light guides traffic. Directly in front, a car is passing a person on the sidewalk, with a cat visible to the left and a bicycle on the right."}
{"left": ["person", "dog"], "down": ["car", "bicycle"], "up": ["traffic light", "stop sign"], "right": ["bus"], "description": "In the distance, a traffic light and stop sign appear along the road. Directly in front, a car and bicycle move steadily, while a person and dog are visible to the left, and a bus sits to the right."}
{"left": ["bird", "tree"], "down": ["person", "horse"], "up": ["windmill"], "right": ["farmhouse"], "description": "A windmill stands in the distance. Directly in front, a person and horse are in a field, while a bird flutters about to the left, and a farmhouse sits to the right."}
{"left": ["person", "bird"], "down": ["car"], "up": ["traffic light", "skyscraper"], "right": ["bus"], "description": "In the distance, a traffic light and skyscraper appear along the road. Directly in front, a car moves steadily, while a person and bird are visible to the left, and a bus sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["traffic light", "building"], "right": ["bench", "tree"], "description": "A traffic light and building appear in the distance. In front, a car navigates the street, while a person with an umbrella walks beside a bike, with a bench to the right and a tree nearby."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "airplane"], "right": ["bench", "tree"], "description": "In the distance, a traffic light and an airplane can be seen in the sky. Directly in front, a car and bus are moving on the road, while a person walks under an umbrella to the left, and a bench and a tree are visible to the right."}
{"left": ["person", "backpack", "handbag"], "down": ["car", "bus"], "up": ["airplane", "traffic light"], "right": ["parking meter", "bench"], "description": "In the distance, an airplane flies overhead, with a traffic light nearby. In front, a car and bus move steadily, while a person with a backpack and handbag are walking to the left, and a parking meter and bench sit to the right."}
{"left": ["cat", "person"], "down": ["car", "traffic light"], "up": ["building", "tree"], "right": ["bus"], "description": "In the distance, a tree and building stand tall. Directly in front, a car moves by a traffic light, while a cat and person are visible to the left, and a bus passes by to the right."}
{"left": ["bench", "potted plant"], "down": ["person", "car"], "up": ["airplane", "building"], "right": ["tree", "backpack"], "description": "In the distance, an airplane soars above a tall building. Directly in front, a person and car are visible, with a bench and potted plant to the left, and a tree and backpack sit to the right, likely belonging to the person."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["parking meter", "traffic light"], "right": ["tree"], "description": "A parking meter and traffic light stand in the distance. Directly in front, a car and bicycle move along the road, with a person under an umbrella to the left and a tree to the right."}
{"left": ["person"], "down": ["car", "parking meter"], "up": ["traffic light", "hospital"], "right": ["bench"], "description": "In the distance, a traffic light and hospital appear along the road. Directly in front, a car and parking meter are visible, while a person is to the left, and a bench sits to the right."}
{"left": ["person"], "down": ["car", "motorcycle"], "up": ["airplane"], "right": ["traffic light"], "description": "An airplane flies in the distance. Directly in front, a car and motorcycle drive along the road, with a person walking to the left, and a traffic light nearby on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light"], "right": ["bus"], "description": "In the distance, a traffic light stands tall. Directly in front, a car moves steadily, with a bicycle nearby and a person under an umbrella to the left, while a bus passes to the right."}
{"left": ["person"], "down": ["car", "traffic light"], "up": ["airplane"], "right": ["pedestrian", "bicycle"], "description": "In the distance, an airplane soars. Directly in front, a person waits at a traffic light next to a car, with a pedestrian walking and a bicycle on the right."}
{"left": ["person", "handbag"], "down": ["car", "traffic light"], "up": ["parking meter"], "right": ["bench"], "description": "In the distance, a parking meter stands on the sidewalk. Directly in front, a car moves steadily through the intersection, with a traffic light controlling the flow of traffic, while a person and handbag are visible to the left, and a bench sits to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["ski resort", "chairlift"], "right": ["bicycle", "hiking trail"], "description": "In the distance, a ski resort and chairlift are visible, uphill. Directly in front, a person and car are near the base, while a bird is perched on a nearby tree to the left, and a bicycle rider heads down the hiking trail to the right."}
{"left": ["person", "umbrella"], "down": ["car", "traffic light"], "up": ["high-rise building", "airplane"], "right": ["bus", "parking meter"], "description": "In the distance, a high-rise building and airplane can be seen. Directly in front, a car stops at a traffic light, while a person holds an umbrella to the left and a bus passes by a parking meter to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "pedestrian crossing"], "right": ["parking meter", "tennis racket"], "description": "In the distance, a traffic light and pedestrian crossing are visible. Directly in front, a car and bus move steadily through the intersection, while a person holding an umbrella is to the left, and a parking meter stands beside a tennis racket on the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane"], "right": ["tree", "house"], "description": "In the distance, an airplane flies by. A car and bus move directly in front, while a person walks on the left and a house stands beside a tree on the right."}
{"left": ["bicycle"], "down": ["person", "car"], "up": ["airplane"], "right": ["bus", "traffic light"], "description": "In the distance, an airplane flies overhead. Directly in front, a person walks beside a car, while a bicycle is parked to the left, and a bus travels down the road with a traffic light nearby."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane", "air traffic control tower"], "right": ["bicycle"], "description": "An airplane flies by in the distance, near an air traffic control tower. In front, a car and bus move steadily, while a person walks to the left, and a bicycle sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "building"], "right": ["bench"], "description": "In the distance, a traffic light and building appear on the horizon. Directly in front, a car and bus move steadily, while a person holding an umbrella walks to the left, and a bench sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["skyscraper", "airplane"], "right": ["bus", "traffic light"], "description": "In the distance, a skyscraper and airplane are visible. Directly in front, a car and bike move, while a person holds an umbrella to the left, and a bus and traffic light are visible to the right."}
{"left": ["person", "bicycle"], "down": ["car", "bus"], "up": ["airplane", "cloud"], "right": ["traffic light"], "description": "In the distance, an airplane flies above the clouds. Directly in front, a car and bus move steadily, while a person is walking to the left and a bicycle beside them, and a traffic light marks the right side."}
{"left": ["person", "bench"], "down": ["car", "umbrella"], "up": ["traffic light", "skyscraper"], "right": ["tree", "bike rack"], "description": "A traffic light and skyscraper are seen in the distance. Directly in front, a car parks under an umbrella, while a person sits on a bench to the left, and a bike rack stands beside a tree on the right."}
{"left": ["person"], "down": ["car", "dog"], "up": ["airplane"], "right": ["bus"], "description": "An airplane flies in the distance above the road. Directly in front, a car and dog are visible, while a person walks alongside on the left, and a bus travels by on the right."}
{"left": ["person", "bicycle"], "down": ["car", "bus"], "up": ["airplane", "cloud"], "right": ["parking meter"], "description": "Far away, an airplane flies overhead amidst fluffy clouds. In front, a car and bus move steadily down the road, while a person walks to the left, accompanied by a bicycle, and a parking meter sits to the right."}
{"left": ["bike rack", "person"], "down": ["car", "traffic light"], "up": ["skyscraper", "airplane"], "right": ["bench"], "description": "In the distance, a large skyscraper and airplane stand tall. Directly in front, a car and traffic light sit at the intersection, while a person is visible to the left, and a bench rests on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light"], "right": ["potted plant", "bench"], "description": "In the distance, a traffic light signals pedestrians. Directly in front, a car and bicycle move alongside, while a person holds an umbrella to the left, and a bench sits beside a potted plant to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["fire hydrant", "parking meter"], "right": ["tree", "bench"], "description": "In the distance, a fire hydrant and parking meter are visible on the sidewalk. Directly in front, a car and bike move along the road, while a person with an umbrella walks to the left, and a tree and bench sit to the right."}
{"left": ["bird", "bicycle"], "down": ["car", "person"], "up": ["traffic light"], "right": ["backpack", "umbrella"], "description": "In the distance, a traffic light guides traffic. Directly in front, a car and person are visible, while a bird perches on a tree to the left, and a person carries a backpack and holds an umbrella to the right."}
{"left": ["tree", "person"], "down": ["dog", "bike"], "up": ["parking meter", "skyscraper"], "right": ["street lamp", "car"], "description": "In the distance, a parking meter and tall skyscraper can be seen. In front, a dog on a bike is moving rapidly, while a person is visible to the left, and a street lamp is next to a car on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "office building"], "right": ["bike rack", "bench"], "description": "An office building stands in the distance, with a traffic light on the corner. In front, a car and bus are driving down the street, while a person walks nearby, holding an umbrella. To the left, a person is visible, and a bike rack with a bench is to the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["traffic light", "skyscraper"], "right": ["bus"], "description": "In the distance, a traffic light and skyscraper rise above the city. Directly in front, a car moves steadily, while a person with an umbrella walks to the left, and a bus passes by on the right."}
{"left": ["person", "bicycle"], "down": ["car", "parking meter"], "up": ["traffic light", "bus"], "right": ["bike rack", "umbrella"], "description": "In the distance, a traffic light and bus appear along the road. Directly in front, a car and parking meter are visible, while a person and bicycle are to the left, and a bike rack and person with an umbrella sit to the right."}
{"left": ["bird", "dog"], "down": ["person", "car"], "up": ["traffic light", "parking meter"], "right": ["bicycle", "bench"], "description": "In the distance, a traffic light and parking meter stand together. Directly in front, a person and car move, while a bicycle and a person's dog are visible to the left, and a bench sits to the right."}
{"left": ["cat", "bench"], "down": ["person", "car"], "up": ["traffic light", "pedestrian crossing sign"], "right": ["tree", "parking meter"], "description": "A traffic light and pedestrian crossing sign appear in the distance, near a tree. In front, a person and car are clearly visible, with a cat to the left and a bench beside a parking meter on the right."}
{"left": ["tree", "bird"], "down": ["person", "dog"], "up": ["power line"], "right": ["house"], "description": "A power line stretches far into the distance. In front, a person walks with a dog, while a tree and bird perch to the left, and a house stands to the right."}
{"left": ["person", "backpack"], "down": ["bus", "stop sign"], "up": ["train", "bridge"], "right": ["tree", "parking meter"], "description": "In the distance, a train crosses a bridge, with a tree and a parking meter visible to the right. Directly in front, a bus stops at a stop sign, while a person with a backpack walks beside it."}
{"left": ["tree", "person"], "down": ["car", "dog"], "up": ["mountain", "airplane"], "right": ["bench"], "description": "In the distance, a mountain and airplane appear above the trees. In front, a car moves steadily, with a dog by its side, while a person is visible to the left, and a bench sits to the right."}
{"left": ["person", "bicycle"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["motorcycle", "parking meter"], "description": "In the distance, an airplane flies by amidst a cloud. A person and bicycle ride to the left, while a car moves steadily in front, and a motorcycle parks adjacent to a parking meter on the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["train"], "right": ["bicycle"], "description": "A train appears in the distance. Directly in front, a person is standing next to a car, while a bird flies overhead and a bicycle is parked to the right."}
{"left": ["person"], "down": ["car", "bike rack"], "up": ["house", "tree"], "right": ["parking meter"], "description": "In the distance, a house and tree stand tall, near a street. Directly in front, a car is parked by a bike rack, while a person is visible to the left, and a parking meter sits to the right."}
{"left": ["person", "dog"], "down": ["car", "bike"], "up": ["stop sign", "tree"], "right": ["parking meter"], "description": "A stop sign and tree are visible in the distance. Directly in front, a car and bike move steadily, while a person and dog are walking to the left, and a parking meter stands to the right."}
{"left": ["person", "umbrella"], "down": ["car", "fire hydrant"], "up": ["building", "bird"], "right": ["bus"], "description": "In the distance, a building and a bird perch atop it. Directly in front, a car stops beside a fire hydrant, while a person stands to the left under an umbrella, and a bus passes by on the right side of the road."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["building", "parking meter"], "right": ["bicycle"], "description": "In the distance, a building and parking meter are visible. Directly in front, a car is near, while a person under an umbrella walks to the left, and a bicycle passes by to the right."}
{"left": ["person"], "down": ["car", "bike rack"], "up": ["parking meter", "fire hydrant"], "right": ["benches"], "description": "In the distance, a parking meter and fire hydrant are visible along the side of the road. Directly in front, a car and bike rack sit side by side, while a person is visible to the left, and benches sit to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["traffic light"], "right": ["stop sign", "tree"], "description": "A traffic light appears in the distance. Directly in front, a car and bike move steadily, while a person is visible to the left under an umbrella, and a stop sign and tree sit to the right."}
{"left": ["person"], "down": ["car", "bike"], "up": ["airplane", "cloud"], "right": ["bus"], "description": "In the distance, an airplane flies by amidst some fluffy clouds. Directly in front, a car and a bike move down the road, while a person is visible to the left, and a bus heads the opposite way to the right."}
{"left": ["parking meter", "umbrella"], "down": ["person", "laptop"], "up": ["high-rise building", "clock"], "right": ["bike rack", "handbag"], "description": "In the distance, a high-rise building stands tall, with a clock visible on the side. Directly in front, a person sits with a laptop, while a parking meter and umbrella are visible to the left, and a bike rack and handbag sit to the right."}
{"left": ["bird", "person"], "down": ["car"], "up": ["airplane", "cloud"], "right": ["traffic light", "bicycle"], "description": "In the distance, an airplane flies overhead with some cloud cover. A person is walking to the left, near a bicycle, while a car moves steadily in front. A traffic light sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "parking meter"], "up": ["traffic light", "building"], "right": ["bench", "tree"], "description": "In the distance, a traffic light and building appear. Directly in front, a car stops near a parking meter, while a person holds an umbrella to the left, and a bench sits under the shade of a tree to the right."}
{"left": ["person", "car"], "down": ["bus", "umbrella"], "up": ["traffic light", "skyscraper"], "right": ["bike rack", "bike"], "description": "In the distance, a traffic light and skyscraper appear above the city. Directly in front, a bus moves steadily, while a person walks under an open umbrella, and a bike rack and bike are visible to the right, near a parked car to the left."}
{"left": ["person", "bike rack"], "down": ["car", "umbrella"], "up": ["fire hydrant", "street sign"], "right": ["bus", "pedestrian crossing"], "description": "In the distance, a fire hydrant and street sign mark the road's edge. A person holds an umbrella in front, while a car moves by, with a bike rack to the left and a bus stopped at a crossing on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "fire hydrant"], "right": ["bike rack", "bicycle"], "description": "A traffic light and fire hydrant appear in the distance. A car and bus move steadily in front, while a person holding an umbrella walks to the left, and a bicycle leans against a bike rack on the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["buildings"], "right": ["bus"], "description": "In the distance, buildings stand tall. Directly in front, a person walks down the sidewalk with a car passing by, while a bird perches on a tree to the left and a bus drives down the road to the right."}
{"left": ["person"], "down": ["car", "traffic light"], "up": ["parking meter", "bench"], "right": ["bicycle"], "description": "In the distance, a parking meter and bench are seen along the sidewalk. Directly in front, a car slows down beside a traffic light, and a person is visible to the left, with a bicycle parked on the right."}
{"left": ["person", "bike"], "down": ["car", "bike"], "up": ["airplane", "cloud"], "right": ["bus"], "description": "In the distance, an airplane soars above the sky amidst a cloud. Directly in front, a car and bike move steadily, while a person pedals along beside another bike to the left and a bus sits nearby to the right."}
{"left": ["person"], "down": ["car", "traffic light"], "up": ["skyscraper", "hot air balloon"], "right": ["bike shop"], "description": "In the distance, a skyscraper and hot air balloon are visible. Directly in front, a car and traffic light are seen, with a person to the left and a bike shop to the right."}
{"left": ["bird", "tree"], "down": ["person", "skateboard"], "up": ["mountain"], "right": ["bench", "potted plant"], "description": "In the distance, a mountain rises above the landscape. Directly in front, a person effortlessly glides on a skateboard, while a bird perches to the left, and a bench sits next to a potted plant on the right."}
{"left": ["person", "handbag", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "skyscraper"], "right": ["bench"], "description": "In the distance, a traffic light and tall building stand. Directly in front, a car and bus move steadily, while a person carrying a handbag and umbrella are visible to the left, and a bench sits to the right."}
{"left": ["person", "dog"], "down": ["car", "bike"], "up": ["fire hydrant", "traffic light"], "right": ["bicycle"], "description": "A fire hydrant and traffic light are visible in the distance. Directly in front, a car and bike are moving, while a person walks to the left with a dog, and a bicycle is parked to the right."}
{"left": ["person", "bike rack"], "down": ["car", "parking meter"], "up": ["traffic light", "bus"], "right": ["traffic cone", "handbag"], "description": "A traffic light and bus are visible in the distance. Directly in front, a car is parked beside a parking meter, while a person and bike rack are to the left, and a traffic cone and handbag sit to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bike"], "up": ["traffic light", "parking meter"], "right": ["bus"], "description": "In the distance, a traffic light and parking meter are seen, guiding traffic. A person under an umbrella is in front, near a car and bike. To the left, the person sits, while a bus passes by on the right."}
{"left": ["person", "skateboard"], "down": ["car"], "up": ["traffic light"], "right": ["bench", "tree"], "description": "A traffic light appears in the distance. Directly in front, a car is visible, while a person is skateboarding to the left, and a bench sits beside a tree on the right."}
{"left": ["person", "umbrella"], "down": ["car", "traffic light"], "up": ["airplane", "cloud"], "right": ["bench"], "description": "In the distance, an airplane flies above a cloud. Directly in front, a car and traffic light are visible, with a person holding an umbrella to the left, and a bench sits to the right."}
{"left": ["person", "umbrella"], "down": ["car"], "up": ["bus"], "right": ["traffic light", "parking meter"], "description": "In the distance, a bus travels down the road. In front, a car drives steadily, while a person holds an umbrella to the left, and a traffic light with a nearby parking meter sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "skyscraper"], "right": ["bench", "tree"], "description": "In the distance, a traffic light and skyscraper stand tall, while a person holds an umbrella to the left. Directly in front, a car and bus move steadily, with a bench to the right under the shade of a tree."}
{"left": ["person", "umbrella"], "down": ["car", "traffic light"], "up": ["skyscraper"], "right": ["bike rack"], "description": "In the distance, a skyscraper stands tall. Directly in front, a car moves steadily beneath a traffic light, while a person walks to the left, holding an umbrella, and a bike rack sits to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["airplane", "cloud"], "right": ["bench"], "description": "In the distance, an airplane flies above a cloud. Directly in front, a person and car are visible, with a bird perched on a tree to the left and a bench sits to the right."}
{"left": ["person", "umbrella"], "down": ["bus", "parking meter"], "up": ["traffic light"], "right": ["car", "bike rack"], "description": "In the distance, a traffic light is visible. Directly in front, a bus moves steadily, and a person stands under an umbrella, near a parking meter. To the left, the person is visible, and a bike rack sits to the right with a car parked behind it."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light"], "right": ["bench", "potted plant"], "description": "A traffic light stands in the distance. In front, a car and bicycle move down the street, with a person walking to the left under an umbrella. To the right, a bench and potted plant sit beside the sidewalk."}
{"left": ["person", "car"], "down": ["bus", "traffic light"], "up": ["building", "bird"], "right": ["tree", "bike rack"], "description": "A building and a bird can be seen in the distance. In front, a bus and a traffic light are clearly visible, while a person and a car are visible to the left, and a bike rack stands near a tree to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light"], "right": ["parking meter"], "description": "A traffic light appears in the distance. In front, a car and bicycle move steadily, with a person holding an umbrella to the left, and a parking meter sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light"], "right": ["bench", "potted plant"], "description": "In the distance, a traffic light stands tall. In front, a car and bicycle move, with a person holding an umbrella nearby. To the left, a person walks, and on the right, a bench and potted plant are situated."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["traffic light", "parking meter"], "right": ["traffic light", "person"], "description": "A traffic light and parking meter are seen in the distance. Directly in front, a car and bicycle move steadily, while a person holds an umbrella to the left and another person stands beside a traffic light to the right."}
{"left": ["person", "umbrella"], "down": ["car", "traffic light"], "up": ["skyscraper"], "right": ["bus"], "description": "A skyscraper towers in the distance. Directly in front, a car navigates through the city, stopped briefly at a traffic light, while a person under an umbrella is to the left, and a bus moves steadily on the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light"], "right": ["parking meter", "bicycle"], "description": "A traffic light appears in the distance. In front, a car and bus move steadily, while a person walks to the left under an umbrella and a bicycle is parked beside a parking meter on the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["mountain"], "right": ["bench", "potted plant"], "description": "A mountain peaks in the distance. In front, a person and car are clearly visible, with a bird perched nearby to the left, and a person rests on a bench beside a potted plant on the right."}
{"left": ["person", "skateboard"], "down": ["car", "bike rack"], "up": ["building", "TV antenna"], "right": ["parking meter", "umbrella"], "description": "In the distance, a building and TV antenna rise above the street. Directly in front, a car is parked beside a bike rack, while a person is skateboarding to the left, and a parking meter and umbrella sit to the right."}
{"left": ["train", "umbrella"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bicycle"], "description": "A traffic light is visible in the distance. In front, a person and car move steadily, while a train is approaching from the left, and a person with an umbrella rides a bicycle to the right."}
{"left": ["dog", "tree"], "down": ["person", "skateboard", "parking meter"], "up": ["building"], "right": ["car", "bike rack"], "description": "In the distance, a building appears along the road. Directly in front, a person skateboards, and a parking meter is nearby, while a dog stands to the left, and a car sits beside a bike rack on the right."}
{"left": ["person"], "down": ["car", "bike"], "up": ["building", "tree"], "right": ["parking meter"], "description": "In the distance, a building and tree are visible, while a car and a bike are in front of the viewer, to the right of the car is a parking meter."}
{"left": ["person"], "down": ["car", "backpack"], "up": ["building", "tree"], "right": ["bench"], "description": "A building and tree stand in the distance. In front, a car stops with a person carrying a backpack, while a bench sits to the right."}
{"left": ["person"], "down": ["car", "bicycle", "fire hydrant"], "up": ["traffic light"], "right": ["traffic light", "bus"], "description": "In the distance, a traffic light stands tall. Directly in front, a car and bicycle move steadily past a fire hydrant, while a person walks alongside, and another traffic light guides a bus on the right."}
{"left": ["person", "bicycle"], "down": ["car", "traffic light"], "up": ["airplane", "airport building"], "right": ["suitcase", "handbag"], "description": "In the distance, an airplane flies overhead and an airport building is visible. Directly in front, a car approaches a traffic light, while a person walks to the left and a bicycle next to them, with a suitcase and handbag on the right side of the road."}
{"left": ["bird", "person"], "down": ["car"], "up": ["traffic light"], "right": ["parking meter", "bicycle"], "description": "A traffic light shines brightly in the distance, with a person and bird walking nearby. Directly in front, a car drives steadily, and a bicycle is parked next to a parking meter to the right."}
{"left": ["person", "bench"], "down": ["bus", "car"], "up": ["airplane", "bird"], "right": ["tree", "potted plant"], "description": "In the distance, an airplane and bird fly overhead. Directly in front, a bus and car move steadily, while a person sits on a bench to the left, and a tree and potted plant are visible to the right."}
{"left": ["bird"], "down": ["person", "car"], "up": ["fire hydrant", "stop sign"], "right": ["bus", "bicycle"], "description": "In the distance, a fire hydrant and stop sign stand on the corner. In front, a person and car are clearly visible, with a bird to the left and a bus and bicycle on the right."}
{"left": ["person"], "down": ["car"], "up": ["traffic light", "building"], "right": ["stop sign", "bench"], "description": "A traffic light and building are visible in the distance. Directly in front, a car is moving steadily, while a person is walking to the left, and a stop sign and bench sit to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light", "airplane"], "right": ["bench", "tree"], "description": "In the distance, an airplane flies by a traffic light. Directly in front, a car and bus move steadily along the road, while a person stands under an umbrella to the left, and a bench sits beside a tree to the right."}
{"left": ["umbrella", "backpack"], "down": ["person", "bike"], "up": ["building", "tree"], "right": ["car"], "description": "In the distance, a building and tree stand tall. Directly in front, a person holds an umbrella and wears a backpack, riding a bike towards the left. A car drives by to the right."}
{"left": ["bird", "tree"], "down": ["person", "car"], "up": ["mountain", "airplane"], "right": ["bicycle", "bench"], "description": "In the distance, a mountain and an airplane soar overhead. Directly in front, a person and car move along the road, while a bird perches to the left, and a bicycle and bench sit to the right, offering a scenic view."}
{"left": ["tree", "bird"], "down": ["person", "dog"], "up": ["house", "car"], "right": ["bench"], "description": "In the distance, a house and car can be seen nearby a tree. Directly in front, a person and a dog are visible, with a bird perched on the tree to the left, and a bench sits to the right."}
{"left": ["dog", "person"], "down": ["car", "bike rack"], "up": ["traffic light", "bus"], "right": ["parking meter"], "description": "In the distance, a traffic light and bus move steadily. Directly in front, a car is parked with a bike rack nearby, while a person walks with a dog, and a parking meter sits to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bicycle"], "up": ["building", "bird"], "right": ["fire hydrant", "stop sign"], "description": "In the distance, a building and a bird take shape. Directly in front, a car and bicycle are moving, while a person walks to the left under an umbrella, and a fire hydrant and stop sign are situated to the right."}
{"left": ["bird", "tree"], "down": ["person", "bike"], "up": ["mountain"], "right": ["car", "house"], "description": "In the distance, a mountain rises above. Directly in front, a person pedals a bike, with a bird perched nearby, while a car passes to the right in front of a house."}
{"left": ["cat", "person"], "down": ["car", "backpack"], "up": ["bench", "potted plant"], "right": ["umbrella", "handbag"], "description": "In the distance, a bench and potted plant are visible. Directly in front, a car and backpack are seen, while a person walks by on the left, and an umbrella and handbag sit on the right."}
{"left": ["person"], "down": ["dog", "umbrella"], "up": ["skyscraper", "giraffe"], "right": ["bike rack"], "description": "A skyscraper and giraffe are visible in the distance. Directly in front, a person strolls with an umbrella, accompanied by a dog, while a bike rack sits to the right."}
{"left": ["person"], "down": ["car", "stop sign"], "up": ["airplane"], "right": ["bicycle"], "description": "In the distance, an airplane soars above. Directly in front, a car stops beside a stop sign, while a person is visible to the left, and a bicycle rides by on the right."}
{"left": ["tree", "person"], "down": ["car", "pedestrian"], "up": ["windmill", "mountain"], "right": ["hiking trail"], "description": "In the distance, a windmill and mountain stand out. Directly in front, a car and pedestrian are visible, while a person walks along a hiking trail to the right, beneath a nearby tree."}
{"left": ["dog", "umbrella"], "down": ["person", "car"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light is visible. Directly in front, a person and car are seen, while a dog and person with an umbrella are to the left, and a bicycle is on the right, likely waiting to cross the road."}
{"left": ["person", "umbrella"], "down": ["car", "traffic light"], "up": ["skyscraper"], "right": ["motorcycle", "parking meter"], "description": "In the distance, a skyscraper rises above the horizon. Directly in front, a car and traffic light are visible, with a person under an umbrella to the left, and a motorcycle parked beside a parking meter to the right."}
{"left": ["person", "skateboard"], "down": ["car", "traffic light"], "up": ["airplane", "cloud"], "right": ["bicycle"], "description": "An airplane soars in the distant sky. In front, a car stops at a traffic light, while a person skateboards to the left and a bicycle rides by to the right."}
{"left": ["person", "umbrella"], "down": ["car", "bus"], "up": ["traffic light"], "right": ["bicycle"], "description": "In the distance, a traffic light controls the flow of vehicles. Directly in front, a car and bus move steadily, while a person holds an umbrella and a bicycle sits to the right."}
{"left": ["person", "bike rack"], "down": ["car", "parking meter"], "up": ["traffic light"], "right": ["bench"], "description": "In the distance, a traffic light controls the flow of traffic. In front, a car parks next to a parking meter, while a person sits on a bike rack to the left, and a bench sits to the right."}
{"left": ["person"], "down": ["car", "bus"], "up": ["airplane"], "right": ["traffic light", "bicycle"], "description": "In the distance, an airplane soars overhead. Directly in front, a car and bus move steadily, with a person walking to the left and a traffic light and bicycle to the right."}
